dylad/RIOT/cpu/sam0_common/include/vendor/same54/include/compat_same54.h
#ifndef COMPAT_SAME54_H
#define COMPAT_SAME54_H

#ifdef __cplusplus
extern "C" {
#endif

#define _Msk (_U_(0x1) << )
#define CAN_DBTP_TDC_Msk (_U_(0x1) << CAN_DBTP_TDC_Pos)
#define CAN_TEST_LBCK_Msk (_U_(0x1) << CAN_TEST_LBCK_Pos)
#define CAN_TEST_RX_Msk (_U_(0x1) << CAN_TEST_RX_Pos)
#define CAN_CCCR_INIT_Msk (_U_(0x1) << CAN_CCCR_INIT_Pos)
#define CAN_CCCR_CCE_Msk (_U_(0x1) << CAN_CCCR_CCE_Pos)
#define CAN_CCCR_ASM_Msk (_U_(0x1) << CAN_CCCR_ASM_Pos)
#define CAN_CCCR_CSA_Msk (_U_(0x1) << CAN_CCCR_CSA_Pos)
#define CAN_CCCR_CSR_Msk (_U_(0x1) << CAN_CCCR_CSR_Pos)
#define CAN_CCCR_MON_Msk (_U_(0x1) << CAN_CCCR_MON_Pos)
#define CAN_CCCR_DAR_Msk (_U_(0x1) << CAN_CCCR_DAR_Pos)
#define CAN_CCCR_TEST_Msk (_U_(0x1) << CAN_CCCR_TEST_Pos)
#define CAN_CCCR_FDOE_Msk (_U_(0x1) << CAN_CCCR_FDOE_Pos)
#define CAN_CCCR_BRSE_Msk (_U_(0x1) << CAN_CCCR_BRSE_Pos)
#define CAN_CCCR_PXHD_Msk (_U_(0x1) << CAN_CCCR_PXHD_Pos)
#define CAN_CCCR_EFBI_Msk (_U_(0x1) << CAN_CCCR_EFBI_Pos)
#define CAN_CCCR_TXP_Msk (_U_(0x1) << CAN_CCCR_TXP_Pos)
#define CAN_CCCR_NISO_Msk (_U_(0x1) << CAN_CCCR_NISO_Pos)
#define CAN_TOCC_ETOC_Msk (_U_(0x1) << CAN_TOCC_ETOC_Pos)
#define CAN_ECR_RP_Msk (_U_(0x1) << CAN_ECR_RP_Pos)
#define CAN_PSR_EP_Msk (_U_(0x1) << CAN_PSR_EP_Pos)
#define CAN_PSR_EW_Msk (_U_(0x1) << CAN_PSR_EW_Pos)
#define CAN_PSR_BO_Msk (_U_(0x1) << CAN_PSR_BO_Pos)
#define CAN_PSR_RESI_Msk (_U_(0x1) << CAN_PSR_RESI_Pos)
#define CAN_PSR_RBRS_Msk (_U_(0x1) << CAN_PSR_RBRS_Pos)
#define CAN_PSR_RFDF_Msk (_U_(0x1) << CAN_PSR_RFDF_Pos)
#define CAN_PSR_PXE_Msk (_U_(0x1) << CAN_PSR_PXE_Pos)
#define CAN_IR_RF0N_Msk (_U_(0x1) << CAN_IR_RF0N_Pos)
#define CAN_IR_RF0W_Msk (_U_(0x1) << CAN_IR_RF0W_Pos)
#define CAN_IR_RF0F_Msk (_U_(0x1) << CAN_IR_RF0F_Pos)
#define CAN_IR_RF0L_Msk (_U_(0x1) << CAN_IR_RF0L_Pos)
#define CAN_IR_RF1N_Msk (_U_(0x1) << CAN_IR_RF1N_Pos)
#define CAN_IR_RF1W_Msk (_U_(0x1) << CAN_IR_RF1W_Pos)
#define CAN_IR_RF1F_Msk (_U_(0x1) << CAN_IR_RF1F_Pos)
#define CAN_IR_RF1L_Msk (_U_(0x1) << CAN_IR_RF1L_Pos)
#define CAN_IR_HPM_Msk (_U_(0x1) << CAN_IR_HPM_Pos)
#define CAN_IR_TC_Msk (_U_(0x1) << CAN_IR_TC_Pos)
#define CAN_IR_TCF_Msk (_U_(0x1) << CAN_IR_TCF_Pos)
#define CAN_IR_TFE_Msk (_U_(0x1) << CAN_IR_TFE_Pos)
#define CAN_IR_TEFN_Msk (_U_(0x1) << CAN_IR_TEFN_Pos)
#define CAN_IR_TEFW_Msk (_U_(0x1) << CAN_IR_TEFW_Pos)
#define CAN_IR_TEFF_Msk (_U_(0x1) << CAN_IR_TEFF_Pos)
#define CAN_IR_TEFL_Msk (_U_(0x1) << CAN_IR_TEFL_Pos)
#define CAN_IR_TSW_Msk (_U_(0x1) << CAN_IR_TSW_Pos)
#define CAN_IR_MRAF_Msk (_U_(0x1) << CAN_IR_MRAF_Pos)
#define CAN_IR_TOO_Msk (_U_(0x1) << CAN_IR_TOO_Pos)
#define CAN_IR_DRX_Msk (_U_(0x1) << CAN_IR_DRX_Pos)
#define CAN_IR_BEC_Msk (_U_(0x1) << CAN_IR_BEC_Pos)
#define CAN_IR_BEU_Msk (_U_(0x1) << CAN_IR_BEU_Pos)
#define CAN_IR_ELO_Msk (_U_(0x1) << CAN_IR_ELO_Pos)
#define CAN_IR_EP_Msk (_U_(0x1) << CAN_IR_EP_Pos)
#define CAN_IR_EW_Msk (_U_(0x1) << CAN_IR_EW_Pos)
#define CAN_IR_BO_Msk (_U_(0x1) << CAN_IR_BO_Pos)
#define CAN_IR_WDI_Msk (_U_(0x1) << CAN_IR_WDI_Pos)
#define CAN_IR_PEA_Msk (_U_(0x1) << CAN_IR_PEA_Pos)
#define CAN_IR_PED_Msk (_U_(0x1) << CAN_IR_PED_Pos)
#define CAN_IR_ARA_Msk (_U_(0x1) << CAN_IR_ARA_Pos)
#define CAN_IE_RF0NE_Msk (_U_(0x1) << CAN_IE_RF0NE_Pos)
#define CAN_IE_RF0WE_Msk (_U_(0x1) << CAN_IE_RF0WE_Pos)
#define CAN_IE_RF0FE_Msk (_U_(0x1) << CAN_IE_RF0FE_Pos)
#define CAN_IE_RF0LE_Msk (_U_(0x1) << CAN_IE_RF0LE_Pos)
#define CAN_IE_RF1NE_Msk (_U_(0x1) << CAN_IE_RF1NE_Pos)
#define CAN_IE_RF1WE_Msk (_U_(0x1) << CAN_IE_RF1WE_Pos)
#define CAN_IE_RF1FE_Msk (_U_(0x1) << CAN_IE_RF1FE_Pos)
#define CAN_IE_RF1LE_Msk (_U_(0x1) << CAN_IE_RF1LE_Pos)
#define CAN_IE_HPME_Msk (_U_(0x1) << CAN_IE_HPME_Pos)
#define CAN_IE_TCE_Msk (_U_(0x1) << CAN_IE_TCE_Pos)
#define CAN_IE_TCFE_Msk (_U_(0x1) << CAN_IE_TCFE_Pos)
#define CAN_IE_TFEE_Msk (_U_(0x1) << CAN_IE_TFEE_Pos)
#define CAN_IE_TEFNE_Msk (_U_(0x1) << CAN_IE_TEFNE_Pos)
#define CAN_IE_TEFWE_Msk (_U_(0x1) << CAN_IE_TEFWE_Pos)
#define CAN_IE_TEFFE_Msk (_U_(0x1) << CAN_IE_TEFFE_Pos)
#define CAN_IE_TEFLE_Msk (_U_(0x1) << CAN_IE_TEFLE_Pos)
#define CAN_IE_TSWE_Msk (_U_(0x1) << CAN_IE_TSWE_Pos)
#define CAN_IE_MRAFE_Msk (_U_(0x1) << CAN_IE_MRAFE_Pos)
#define CAN_IE_TOOE_Msk (_U_(0x1) << CAN_IE_TOOE_Pos)
#define CAN_IE_DRXE_Msk (_U_(0x1) << CAN_IE_DRXE_Pos)
#define CAN_IE_BECE_Msk (_U_(0x1) << CAN_IE_BECE_Pos)
#define CAN_IE_BEUE_Msk (_U_(0x1) << CAN_IE_BEUE_Pos)
#define CAN_IE_ELOE_Msk (_U_(0x1) << CAN_IE_ELOE_Pos)
#define CAN_IE_EPE_Msk (_U_(0x1) << CAN_IE_EPE_Pos)
#define CAN_IE_EWE_Msk (_U_(0x1) << CAN_IE_EWE_Pos)
#define CAN_IE_BOE_Msk (_U_(0x1) << CAN_IE_BOE_Pos)
#define CAN_IE_WDIE_Msk (_U_(0x1) << CAN_IE_WDIE_Pos)
#define CAN_IE_PEAE_Msk (_U_(0x1) << CAN_IE_PEAE_Pos)
#define CAN_IE_PEDE_Msk (_U_(0x1) << CAN_IE_PEDE_Pos)
#define CAN_IE_ARAE_Msk (_U_(0x1) << CAN_IE_ARAE_Pos)
#define CAN_ILS_RF0NL_Msk (_U_(0x1) << CAN_ILS_RF0NL_Pos)
#define CAN_ILS_RF0WL_Msk (_U_(0x1) << CAN_ILS_RF0WL_Pos)
#define CAN_ILS_RF0FL_Msk (_U_(0x1) << CAN_ILS_RF0FL_Pos)
#define CAN_ILS_RF0LL_Msk (_U_(0x1) << CAN_ILS_RF0LL_Pos)
#define CAN_ILS_RF1NL_Msk (_U_(0x1) << CAN_ILS_RF1NL_Pos)
#define CAN_ILS_RF1WL_Msk (_U_(0x1) << CAN_ILS_RF1WL_Pos)
#define CAN_ILS_RF1FL_Msk (_U_(0x1) << CAN_ILS_RF1FL_Pos)
#define CAN_ILS_RF1LL_Msk (_U_(0x1) << CAN_ILS_RF1LL_Pos)
#define CAN_ILS_HPML_Msk (_U_(0x1) << CAN_ILS_HPML_Pos)
#define CAN_ILS_TCL_Msk (_U_(0x1) << CAN_ILS_TCL_Pos)
#define CAN_ILS_TCFL_Msk (_U_(0x1) << CAN_ILS_TCFL_Pos)
#define CAN_ILS_TFEL_Msk (_U_(0x1) << CAN_ILS_TFEL_Pos)
#define CAN_ILS_TEFNL_Msk (_U_(0x1) << CAN_ILS_TEFNL_Pos)
#define CAN_ILS_TEFWL_Msk (_U_(0x1) << CAN_ILS_TEFWL_Pos)
#define CAN_ILS_TEFFL_Msk (_U_(0x1) << CAN_ILS_TEFFL_Pos)
#define CAN_ILS_TEFLL_Msk (_U_(0x1) << CAN_ILS_TEFLL_Pos)
#define CAN_ILS_TSWL_Msk (_U_(0x1) << CAN_ILS_TSWL_Pos)
#define CAN_ILS_MRAFL_Msk (_U_(0x1) << CAN_ILS_MRAFL_Pos)
#define CAN_ILS_TOOL_Msk (_U_(0x1) << CAN_ILS_TOOL_Pos)
#define CAN_ILS_DRXL_Msk (_U_(0x1) << CAN_ILS_DRXL_Pos)
#define CAN_ILS_BECL_Msk (_U_(0x1) << CAN_ILS_BECL_Pos)
#define CAN_ILS_BEUL_Msk (_U_(0x1) << CAN_ILS_BEUL_Pos)
#define CAN_ILS_ELOL_Msk (_U_(0x1) << CAN_ILS_ELOL_Pos)
#define CAN_ILS_EPL_Msk (_U_(0x1) << CAN_ILS_EPL_Pos)
#define CAN_ILS_EWL_Msk (_U_(0x1) << CAN_ILS_EWL_Pos)
#define CAN_ILS_BOL_Msk (_U_(0x1) << CAN_ILS_BOL_Pos)
#define CAN_ILS_WDIL_Msk (_U_(0x1) << CAN_ILS_WDIL_Pos)
#define CAN_ILS_PEAL_Msk (_U_(0x1) << CAN_ILS_PEAL_Pos)
#define CAN_ILS_PEDL_Msk (_U_(0x1) << CAN_ILS_PEDL_Pos)
#define CAN_ILS_ARAL_Msk (_U_(0x1) << CAN_ILS_ARAL_Pos)
#define CAN_ILE_EINT0_Msk (_U_(0x1) << CAN_ILE_EINT0_Pos)
#define CAN_ILE_EINT1_Msk (_U_(0x1) << CAN_ILE_EINT1_Pos)
#define CAN_GFC_RRFE_Msk (_U_(0x1) << CAN_GFC_RRFE_Pos)
#define CAN_GFC_RRFS_Msk (_U_(0x1) << CAN_GFC_RRFS_Pos)
#define CAN_HPMS_FLST_Msk (_U_(0x1) << CAN_HPMS_FLST_Pos)
#define CAN_NDAT1_ND0_Msk (_U_(0x1) << CAN_NDAT1_ND0_Pos)
#define CAN_NDAT1_ND1_Msk (_U_(0x1) << CAN_NDAT1_ND1_Pos)
#define CAN_NDAT1_ND2_Msk (_U_(0x1) << CAN_NDAT1_ND2_Pos)
#define CAN_NDAT1_ND3_Msk (_U_(0x1) << CAN_NDAT1_ND3_Pos)
#define CAN_NDAT1_ND4_Msk (_U_(0x1) << CAN_NDAT1_ND4_Pos)
#define CAN_NDAT1_ND5_Msk (_U_(0x1) << CAN_NDAT1_ND5_Pos)
#define CAN_NDAT1_ND6_Msk (_U_(0x1) << CAN_NDAT1_ND6_Pos)
#define CAN_NDAT1_ND7_Msk (_U_(0x1) << CAN_NDAT1_ND7_Pos)
#define CAN_NDAT1_ND8_Msk (_U_(0x1) << CAN_NDAT1_ND8_Pos)
#define CAN_NDAT1_ND9_Msk (_U_(0x1) << CAN_NDAT1_ND9_Pos)
#define CAN_NDAT1_ND10_Msk (_U_(0x1) << CAN_NDAT1_ND10_Pos)
#define CAN_NDAT1_ND11_Msk (_U_(0x1) << CAN_NDAT1_ND11_Pos)
#define CAN_NDAT1_ND12_Msk (_U_(0x1) << CAN_NDAT1_ND12_Pos)
#define CAN_NDAT1_ND13_Msk (_U_(0x1) << CAN_NDAT1_ND13_Pos)
#define CAN_NDAT1_ND14_Msk (_U_(0x1) << CAN_NDAT1_ND14_Pos)
#define CAN_NDAT1_ND15_Msk (_U_(0x1) << CAN_NDAT1_ND15_Pos)
#define CAN_NDAT1_ND16_Msk (_U_(0x1) << CAN_NDAT1_ND16_Pos)
#define CAN_NDAT1_ND17_Msk (_U_(0x1) << CAN_NDAT1_ND17_Pos)
#define CAN_NDAT1_ND18_Msk (_U_(0x1) << CAN_NDAT1_ND18_Pos)
#define CAN_NDAT1_ND19_Msk (_U_(0x1) << CAN_NDAT1_ND19_Pos)
#define CAN_NDAT1_ND20_Msk (_U_(0x1) << CAN_NDAT1_ND20_Pos)
#define CAN_NDAT1_ND21_Msk (_U_(0x1) << CAN_NDAT1_ND21_Pos)
#define CAN_NDAT1_ND22_Msk (_U_(0x1) << CAN_NDAT1_ND22_Pos)
#define CAN_NDAT1_ND23_Msk (_U_(0x1) << CAN_NDAT1_ND23_Pos)
#define CAN_NDAT1_ND24_Msk (_U_(0x1) << CAN_NDAT1_ND24_Pos)
#define CAN_NDAT1_ND25_Msk (_U_(0x1) << CAN_NDAT1_ND25_Pos)
#define CAN_NDAT1_ND26_Msk (_U_(0x1) << CAN_NDAT1_ND26_Pos)
#define CAN_NDAT1_ND27_Msk (_U_(0x1) << CAN_NDAT1_ND27_Pos)
#define CAN_NDAT1_ND28_Msk (_U_(0x1) << CAN_NDAT1_ND28_Pos)
#define CAN_NDAT1_ND29_Msk (_U_(0x1) << CAN_NDAT1_ND29_Pos)
#define CAN_NDAT1_ND30_Msk (_U_(0x1) << CAN_NDAT1_ND30_Pos)
#define CAN_NDAT1_ND31_Msk (_U_(0x1) << CAN_NDAT1_ND31_Pos)
#define CAN_NDAT2_ND32_Msk (_U_(0x1) << CAN_NDAT2_ND32_Pos)
#define CAN_NDAT2_ND33_Msk (_U_(0x1) << CAN_NDAT2_ND33_Pos)
#define CAN_NDAT2_ND34_Msk (_U_(0x1) << CAN_NDAT2_ND34_Pos)
#define CAN_NDAT2_ND35_Msk (_U_(0x1) << CAN_NDAT2_ND35_Pos)
#define CAN_NDAT2_ND36_Msk (_U_(0x1) << CAN_NDAT2_ND36_Pos)
#define CAN_NDAT2_ND37_Msk (_U_(0x1) << CAN_NDAT2_ND37_Pos)
#define CAN_NDAT2_ND38_Msk (_U_(0x1) << CAN_NDAT2_ND38_Pos)
#define CAN_NDAT2_ND39_Msk (_U_(0x1) << CAN_NDAT2_ND39_Pos)
#define CAN_NDAT2_ND40_Msk (_U_(0x1) << CAN_NDAT2_ND40_Pos)
#define CAN_NDAT2_ND41_Msk (_U_(0x1) << CAN_NDAT2_ND41_Pos)
#define CAN_NDAT2_ND42_Msk (_U_(0x1) << CAN_NDAT2_ND42_Pos)
#define CAN_NDAT2_ND43_Msk (_U_(0x1) << CAN_NDAT2_ND43_Pos)
#define CAN_NDAT2_ND44_Msk (_U_(0x1) << CAN_NDAT2_ND44_Pos)
#define CAN_NDAT2_ND45_Msk (_U_(0x1) << CAN_NDAT2_ND45_Pos)
#define CAN_NDAT2_ND46_Msk (_U_(0x1) << CAN_NDAT2_ND46_Pos)
#define CAN_NDAT2_ND47_Msk (_U_(0x1) << CAN_NDAT2_ND47_Pos)
#define CAN_NDAT2_ND48_Msk (_U_(0x1) << CAN_NDAT2_ND48_Pos)
#define CAN_NDAT2_ND49_Msk (_U_(0x1) << CAN_NDAT2_ND49_Pos)
#define CAN_NDAT2_ND50_Msk (_U_(0x1) << CAN_NDAT2_ND50_Pos)
#define CAN_NDAT2_ND51_Msk (_U_(0x1) << CAN_NDAT2_ND51_Pos)
#define CAN_NDAT2_ND52_Msk (_U_(0x1) << CAN_NDAT2_ND52_Pos)
#define CAN_NDAT2_ND53_Msk (_U_(0x1) << CAN_NDAT2_ND53_Pos)
#define CAN_NDAT2_ND54_Msk (_U_(0x1) << CAN_NDAT2_ND54_Pos)
#define CAN_NDAT2_ND55_Msk (_U_(0x1) << CAN_NDAT2_ND55_Pos)
#define CAN_NDAT2_ND56_Msk (_U_(0x1) << CAN_NDAT2_ND56_Pos)
#define CAN_NDAT2_ND57_Msk (_U_(0x1) << CAN_NDAT2_ND57_Pos)
#define CAN_NDAT2_ND58_Msk (_U_(0x1) << CAN_NDAT2_ND58_Pos)
#define CAN_NDAT2_ND59_Msk (_U_(0x1) << CAN_NDAT2_ND59_Pos)
#define CAN_NDAT2_ND60_Msk (_U_(0x1) << CAN_NDAT2_ND60_Pos)
#define CAN_NDAT2_ND61_Msk (_U_(0x1) << CAN_NDAT2_ND61_Pos)
#define CAN_NDAT2_ND62_Msk (_U_(0x1) << CAN_NDAT2_ND62_Pos)
#define CAN_NDAT2_ND63_Msk (_U_(0x1) << CAN_NDAT2_ND63_Pos)
#define CAN_RXF0C_F0OM_Msk (_U_(0x1) << CAN_RXF0C_F0OM_Pos)
#define CAN_RXF0S_F0F_Msk (_U_(0x1) << CAN_RXF0S_F0F_Pos)
#define CAN_RXF0S_RF0L_Msk (_U_(0x1) << CAN_RXF0S_RF0L_Pos)
#define CAN_RXF1C_F1OM_Msk (_U_(0x1) << CAN_RXF1C_F1OM_Pos)
#define CAN_RXF1S_F1F_Msk (_U_(0x1) << CAN_RXF1S_F1F_Pos)
#define CAN_RXF1S_RF1L_Msk (_U_(0x1) << CAN_RXF1S_RF1L_Pos)
#define CAN_TXBC_TFQM_Msk (_U_(0x1) << CAN_TXBC_TFQM_Pos)
#define CAN_TXFQS_TFQF_Msk (_U_(0x1) << CAN_TXFQS_TFQF_Pos)
#define CAN_TXBRP_TRP0_Msk (_U_(0x1) << CAN_TXBRP_TRP0_Pos)
#define CAN_TXBRP_TRP1_Msk (_U_(0x1) << CAN_TXBRP_TRP1_Pos)
#define CAN_TXBRP_TRP2_Msk (_U_(0x1) << CAN_TXBRP_TRP2_Pos)
#define CAN_TXBRP_TRP3_Msk (_U_(0x1) << CAN_TXBRP_TRP3_Pos)
#define CAN_TXBRP_TRP4_Msk (_U_(0x1) << CAN_TXBRP_TRP4_Pos)
#define CAN_TXBRP_TRP5_Msk (_U_(0x1) << CAN_TXBRP_TRP5_Pos)
#define CAN_TXBRP_TRP6_Msk (_U_(0x1) << CAN_TXBRP_TRP6_Pos)
#define CAN_TXBRP_TRP7_Msk (_U_(0x1) << CAN_TXBRP_TRP7_Pos)
#define CAN_TXBRP_TRP8_Msk (_U_(0x1) << CAN_TXBRP_TRP8_Pos)
#define CAN_TXBRP_TRP9_Msk (_U_(0x1) << CAN_TXBRP_TRP9_Pos)
#define CAN_TXBRP_TRP10_Msk (_U_(0x1) << CAN_TXBRP_TRP10_Pos)
#define CAN_TXBRP_TRP11_Msk (_U_(0x1) << CAN_TXBRP_TRP11_Pos)
#define CAN_TXBRP_TRP12_Msk (_U_(0x1) << CAN_TXBRP_TRP12_Pos)
#define CAN_TXBRP_TRP13_Msk (_U_(0x1) << CAN_TXBRP_TRP13_Pos)
#define CAN_TXBRP_TRP14_Msk (_U_(0x1) << CAN_TXBRP_TRP14_Pos)
#define CAN_TXBRP_TRP15_Msk (_U_(0x1) << CAN_TXBRP_TRP15_Pos)
#define CAN_TXBRP_TRP16_Msk (_U_(0x1) << CAN_TXBRP_TRP16_Pos)
#define CAN_TXBRP_TRP17_Msk (_U_(0x1) << CAN_TXBRP_TRP17_Pos)
#define CAN_TXBRP_TRP18_Msk (_U_(0x1) << CAN_TXBRP_TRP18_Pos)
#define CAN_TXBRP_TRP19_Msk (_U_(0x1) << CAN_TXBRP_TRP19_Pos)
#define CAN_TXBRP_TRP20_Msk (_U_(0x1) << CAN_TXBRP_TRP20_Pos)
#define CAN_TXBRP_TRP21_Msk (_U_(0x1) << CAN_TXBRP_TRP21_Pos)
#define CAN_TXBRP_TRP22_Msk (_U_(0x1) << CAN_TXBRP_TRP22_Pos)
#define CAN_TXBRP_TRP23_Msk (_U_(0x1) << CAN_TXBRP_TRP23_Pos)
#define CAN_TXBRP_TRP24_Msk (_U_(0x1) << CAN_TXBRP_TRP24_Pos)
#define CAN_TXBRP_TRP25_Msk (_U_(0x1) << CAN_TXBRP_TRP25_Pos)
#define CAN_TXBRP_TRP26_Msk (_U_(0x1) << CAN_TXBRP_TRP26_Pos)
#define CAN_TXBRP_TRP27_Msk (_U_(0x1) << CAN_TXBRP_TRP27_Pos)
#define CAN_TXBRP_TRP28_Msk (_U_(0x1) << CAN_TXBRP_TRP28_Pos)
#define CAN_TXBRP_TRP29_Msk (_U_(0x1) << CAN_TXBRP_TRP29_Pos)
#define CAN_TXBRP_TRP30_Msk (_U_(0x1) << CAN_TXBRP_TRP30_Pos)
#define CAN_TXBRP_TRP31_Msk (_U_(0x1) << CAN_TXBRP_TRP31_Pos)
#define CAN_TXBAR_AR0_Msk (_U_(0x1) << CAN_TXBAR_AR0_Pos)
#define CAN_TXBAR_AR1_Msk (_U_(0x1) << CAN_TXBAR_AR1_Pos)
#define CAN_TXBAR_AR2_Msk (_U_(0x1) << CAN_TXBAR_AR2_Pos)
#define CAN_TXBAR_AR3_Msk (_U_(0x1) << CAN_TXBAR_AR3_Pos)
#define CAN_TXBAR_AR4_Msk (_U_(0x1) << CAN_TXBAR_AR4_Pos)
#define CAN_TXBAR_AR5_Msk (_U_(0x1) << CAN_TXBAR_AR5_Pos)
#define CAN_TXBAR_AR6_Msk (_U_(0x1) << CAN_TXBAR_AR6_Pos)
#define CAN_TXBAR_AR7_Msk (_U_(0x1) << CAN_TXBAR_AR7_Pos)
#define CAN_TXBAR_AR8_Msk (_U_(0x1) << CAN_TXBAR_AR8_Pos)
#define CAN_TXBAR_AR9_Msk (_U_(0x1) << CAN_TXBAR_AR9_Pos)
#define CAN_TXBAR_AR10_Msk (_U_(0x1) << CAN_TXBAR_AR10_Pos)
#define CAN_TXBAR_AR11_Msk (_U_(0x1) << CAN_TXBAR_AR11_Pos)
#define CAN_TXBAR_AR12_Msk (_U_(0x1) << CAN_TXBAR_AR12_Pos)
#define CAN_TXBAR_AR13_Msk (_U_(0x1) << CAN_TXBAR_AR13_Pos)
#define CAN_TXBAR_AR14_Msk (_U_(0x1) << CAN_TXBAR_AR14_Pos)
#define CAN_TXBAR_AR15_Msk (_U_(0x1) << CAN_TXBAR_AR15_Pos)
#define CAN_TXBAR_AR16_Msk (_U_(0x1) << CAN_TXBAR_AR16_Pos)
#define CAN_TXBAR_AR17_Msk (_U_(0x1) << CAN_TXBAR_AR17_Pos)
#define CAN_TXBAR_AR18_Msk (_U_(0x1) << CAN_TXBAR_AR18_Pos)
#define CAN_TXBAR_AR19_Msk (_U_(0x1) << CAN_TXBAR_AR19_Pos)
#define CAN_TXBAR_AR20_Msk (_U_(0x1) << CAN_TXBAR_AR20_Pos)
#define CAN_TXBAR_AR21_Msk (_U_(0x1) << CAN_TXBAR_AR21_Pos)
#define CAN_TXBAR_AR22_Msk (_U_(0x1) << CAN_TXBAR_AR22_Pos)
#define CAN_TXBAR_AR23_Msk (_U_(0x1) << CAN_TXBAR_AR23_Pos)
#define CAN_TXBAR_AR24_Msk (_U_(0x1) << CAN_TXBAR_AR24_Pos)
#define CAN_TXBAR_AR25_Msk (_U_(0x1) << CAN_TXBAR_AR25_Pos)
#define CAN_TXBAR_AR26_Msk (_U_(0x1) << CAN_TXBAR_AR26_Pos)
#define CAN_TXBAR_AR27_Msk (_U_(0x1) << CAN_TXBAR_AR27_Pos)
#define CAN_TXBAR_AR28_Msk (_U_(0x1) << CAN_TXBAR_AR28_Pos)
#define CAN_TXBAR_AR29_Msk (_U_(0x1) << CAN_TXBAR_AR29_Pos)
#define CAN_TXBAR_AR30_Msk (_U_(0x1) << CAN_TXBAR_AR30_Pos)
#define CAN_TXBAR_AR31_Msk (_U_(0x1) << CAN_TXBAR_AR31_Pos)
#define CAN_TXBCR_CR0_Msk (_U_(0x1) << CAN_TXBCR_CR0_Pos)
#define CAN_TXBCR_CR1_Msk (_U_(0x1) << CAN_TXBCR_CR1_Pos)
#define CAN_TXBCR_CR2_Msk (_U_(0x1) << CAN_TXBCR_CR2_Pos)
#define CAN_TXBCR_CR3_Msk (_U_(0x1) << CAN_TXBCR_CR3_Pos)
#define CAN_TXBCR_CR4_Msk (_U_(0x1) << CAN_TXBCR_CR4_Pos)
#define CAN_TXBCR_CR5_Msk (_U_(0x1) << CAN_TXBCR_CR5_Pos)
#define CAN_TXBCR_CR6_Msk (_U_(0x1) << CAN_TXBCR_CR6_Pos)
#define CAN_TXBCR_CR7_Msk (_U_(0x1) << CAN_TXBCR_CR7_Pos)
#define CAN_TXBCR_CR8_Msk (_U_(0x1) << CAN_TXBCR_CR8_Pos)
#define CAN_TXBCR_CR9_Msk (_U_(0x1) << CAN_TXBCR_CR9_Pos)
#define CAN_TXBCR_CR10_Msk (_U_(0x1) << CAN_TXBCR_CR10_Pos)
#define CAN_TXBCR_CR11_Msk (_U_(0x1) << CAN_TXBCR_CR11_Pos)
#define CAN_TXBCR_CR12_Msk (_U_(0x1) << CAN_TXBCR_CR12_Pos)
#define CAN_TXBCR_CR13_Msk (_U_(0x1) << CAN_TXBCR_CR13_Pos)
#define CAN_TXBCR_CR14_Msk (_U_(0x1) << CAN_TXBCR_CR14_Pos)
#define CAN_TXBCR_CR15_Msk (_U_(0x1) << CAN_TXBCR_CR15_Pos)
#define CAN_TXBCR_CR16_Msk (_U_(0x1) << CAN_TXBCR_CR16_Pos)
#define CAN_TXBCR_CR17_Msk (_U_(0x1) << CAN_TXBCR_CR17_Pos)
#define CAN_TXBCR_CR18_Msk (_U_(0x1) << CAN_TXBCR_CR18_Pos)
#define CAN_TXBCR_CR19_Msk (_U_(0x1) << CAN_TXBCR_CR19_Pos)
#define CAN_TXBCR_CR20_Msk (_U_(0x1) << CAN_TXBCR_CR20_Pos)
#define CAN_TXBCR_CR21_Msk (_U_(0x1) << CAN_TXBCR_CR21_Pos)
#define CAN_TXBCR_CR22_Msk (_U_(0x1) << CAN_TXBCR_CR22_Pos)
#define CAN_TXBCR_CR23_Msk (_U_(0x1) << CAN_TXBCR_CR23_Pos)
#define CAN_TXBCR_CR24_Msk (_U_(0x1) << CAN_TXBCR_CR24_Pos)
#define CAN_TXBCR_CR25_Msk (_U_(0x1) << CAN_TXBCR_CR25_Pos)
#define CAN_TXBCR_CR26_Msk (_U_(0x1) << CAN_TXBCR_CR26_Pos)
#define CAN_TXBCR_CR27_Msk (_U_(0x1) << CAN_TXBCR_CR27_Pos)
#define CAN_TXBCR_CR28_Msk (_U_(0x1) << CAN_TXBCR_CR28_Pos)
#define CAN_TXBCR_CR29_Msk (_U_(0x1) << CAN_TXBCR_CR29_Pos)
#define CAN_TXBCR_CR30_Msk (_U_(0x1) << CAN_TXBCR_CR30_Pos)
#define CAN_TXBCR_CR31_Msk (_U_(0x1) << CAN_TXBCR_CR31_Pos)
#define CAN_TXBTO_TO0_Msk (_U_(0x1) << CAN_TXBTO_TO0_Pos)
#define CAN_TXBTO_TO1_Msk (_U_(0x1) << CAN_TXBTO_TO1_Pos)
#define CAN_TXBTO_TO2_Msk (_U_(0x1) << CAN_TXBTO_TO2_Pos)
#define CAN_TXBTO_TO3_Msk (_U_(0x1) << CAN_TXBTO_TO3_Pos)
#define CAN_TXBTO_TO4_Msk (_U_(0x1) << CAN_TXBTO_TO4_Pos)
#define CAN_TXBTO_TO5_Msk (_U_(0x1) << CAN_TXBTO_TO5_Pos)
#define CAN_TXBTO_TO6_Msk (_U_(0x1) << CAN_TXBTO_TO6_Pos)
#define CAN_TXBTO_TO7_Msk (_U_(0x1) << CAN_TXBTO_TO7_Pos)
#define CAN_TXBTO_TO8_Msk (_U_(0x1) << CAN_TXBTO_TO8_Pos)
#define CAN_TXBTO_TO9_Msk (_U_(0x1) << CAN_TXBTO_TO9_Pos)
#define CAN_TXBTO_TO10_Msk (_U_(0x1) << CAN_TXBTO_TO10_Pos)
#define CAN_TXBTO_TO11_Msk (_U_(0x1) << CAN_TXBTO_TO11_Pos)
#define CAN_TXBTO_TO12_Msk (_U_(0x1) << CAN_TXBTO_TO12_Pos)
#define CAN_TXBTO_TO13_Msk (_U_(0x1) << CAN_TXBTO_TO13_Pos)
#define CAN_TXBTO_TO14_Msk (_U_(0x1) << CAN_TXBTO_TO14_Pos)
#define CAN_TXBTO_TO15_Msk (_U_(0x1) << CAN_TXBTO_TO15_Pos)
#define CAN_TXBTO_TO16_Msk (_U_(0x1) << CAN_TXBTO_TO16_Pos)
#define CAN_TXBTO_TO17_Msk (_U_(0x1) << CAN_TXBTO_TO17_Pos)
#define CAN_TXBTO_TO18_Msk (_U_(0x1) << CAN_TXBTO_TO18_Pos)
#define CAN_TXBTO_TO19_Msk (_U_(0x1) << CAN_TXBTO_TO19_Pos)
#define CAN_TXBTO_TO20_Msk (_U_(0x1) << CAN_TXBTO_TO20_Pos)
#define CAN_TXBTO_TO21_Msk (_U_(0x1) << CAN_TXBTO_TO21_Pos)
#define CAN_TXBTO_TO22_Msk (_U_(0x1) << CAN_TXBTO_TO22_Pos)
#define CAN_TXBTO_TO23_Msk (_U_(0x1) << CAN_TXBTO_TO23_Pos)
#define CAN_TXBTO_TO24_Msk (_U_(0x1) << CAN_TXBTO_TO24_Pos)
#define CAN_TXBTO_TO25_Msk (_U_(0x1) << CAN_TXBTO_TO25_Pos)
#define CAN_TXBTO_TO26_Msk (_U_(0x1) << CAN_TXBTO_TO26_Pos)
#define CAN_TXBTO_TO27_Msk (_U_(0x1) << CAN_TXBTO_TO27_Pos)
#define CAN_TXBTO_TO28_Msk (_U_(0x1) << CAN_TXBTO_TO28_Pos)
#define CAN_TXBTO_TO29_Msk (_U_(0x1) << CAN_TXBTO_TO29_Pos)
#define CAN_TXBTO_TO30_Msk (_U_(0x1) << CAN_TXBTO_TO30_Pos)
#define CAN_TXBTO_TO31_Msk (_U_(0x1) << CAN_TXBTO_TO31_Pos)
#define CAN_TXBCF_CF0_Msk (_U_(0x1) << CAN_TXBCF_CF0_Pos)
#define CAN_TXBCF_CF1_Msk (_U_(0x1) << CAN_TXBCF_CF1_Pos)
#define CAN_TXBCF_CF2_Msk (_U_(0x1) << CAN_TXBCF_CF2_Pos)
#define CAN_TXBCF_CF3_Msk (_U_(0x1) << CAN_TXBCF_CF3_Pos)
#define CAN_TXBCF_CF4_Msk (_U_(0x1) << CAN_TXBCF_CF4_Pos)
#define CAN_TXBCF_CF5_Msk (_U_(0x1) << CAN_TXBCF_CF5_Pos)
#define CAN_TXBCF_CF6_Msk (_U_(0x1) << CAN_TXBCF_CF6_Pos)
#define CAN_TXBCF_CF7_Msk (_U_(0x1) << CAN_TXBCF_CF7_Pos)
#define CAN_TXBCF_CF8_Msk (_U_(0x1) << CAN_TXBCF_CF8_Pos)
#define CAN_TXBCF_CF9_Msk (_U_(0x1) << CAN_TXBCF_CF9_Pos)
#define CAN_TXBCF_CF10_Msk (_U_(0x1) << CAN_TXBCF_CF10_Pos)
#define CAN_TXBCF_CF11_Msk (_U_(0x1) << CAN_TXBCF_CF11_Pos)
#define CAN_TXBCF_CF12_Msk (_U_(0x1) << CAN_TXBCF_CF12_Pos)
#define CAN_TXBCF_CF13_Msk (_U_(0x1) << CAN_TXBCF_CF13_Pos)
#define CAN_TXBCF_CF14_Msk (_U_(0x1) << CAN_TXBCF_CF14_Pos)
#define CAN_TXBCF_CF15_Msk (_U_(0x1) << CAN_TXBCF_CF15_Pos)
#define CAN_TXBCF_CF16_Msk (_U_(0x1) << CAN_TXBCF_CF16_Pos)
#define CAN_TXBCF_CF17_Msk (_U_(0x1) << CAN_TXBCF_CF17_Pos)
#define CAN_TXBCF_CF18_Msk (_U_(0x1) << CAN_TXBCF_CF18_Pos)
#define CAN_TXBCF_CF19_Msk (_U_(0x1) << CAN_TXBCF_CF19_Pos)
#define CAN_TXBCF_CF20_Msk (_U_(0x1) << CAN_TXBCF_CF20_Pos)
#define CAN_TXBCF_CF21_Msk (_U_(0x1) << CAN_TXBCF_CF21_Pos)
#define CAN_TXBCF_CF22_Msk (_U_(0x1) << CAN_TXBCF_CF22_Pos)
#define CAN_TXBCF_CF23_Msk (_U_(0x1) << CAN_TXBCF_CF23_Pos)
#define CAN_TXBCF_CF24_Msk (_U_(0x1) << CAN_TXBCF_CF24_Pos)
#define CAN_TXBCF_CF25_Msk (_U_(0x1) << CAN_TXBCF_CF25_Pos)
#define CAN_TXBCF_CF26_Msk (_U_(0x1) << CAN_TXBCF_CF26_Pos)
#define CAN_TXBCF_CF27_Msk (_U_(0x1) << CAN_TXBCF_CF27_Pos)
#define CAN_TXBCF_CF28_Msk (_U_(0x1) << CAN_TXBCF_CF28_Pos)
#define CAN_TXBCF_CF29_Msk (_U_(0x1) << CAN_TXBCF_CF29_Pos)
#define CAN_TXBCF_CF30_Msk (_U_(0x1) << CAN_TXBCF_CF30_Pos)
#define CAN_TXBCF_CF31_Msk (_U_(0x1) << CAN_TXBCF_CF31_Pos)
#define CAN_TXBTIE_TIE0_Msk (_U_(0x1) << CAN_TXBTIE_TIE0_Pos)
#define CAN_TXBTIE_TIE1_Msk (_U_(0x1) << CAN_TXBTIE_TIE1_Pos)
#define CAN_TXBTIE_TIE2_Msk (_U_(0x1) << CAN_TXBTIE_TIE2_Pos)
#define CAN_TXBTIE_TIE3_Msk (_U_(0x1) << CAN_TXBTIE_TIE3_Pos)
#define CAN_TXBTIE_TIE4_Msk (_U_(0x1) << CAN_TXBTIE_TIE4_Pos)
#define CAN_TXBTIE_TIE5_Msk (_U_(0x1) << CAN_TXBTIE_TIE5_Pos)
#define CAN_TXBTIE_TIE6_Msk (_U_(0x1) << CAN_TXBTIE_TIE6_Pos)
#define CAN_TXBTIE_TIE7_Msk (_U_(0x1) << CAN_TXBTIE_TIE7_Pos)
#define CAN_TXBTIE_TIE8_Msk (_U_(0x1) << CAN_TXBTIE_TIE8_Pos)
#define CAN_TXBTIE_TIE9_Msk (_U_(0x1) << CAN_TXBTIE_TIE9_Pos)
#define CAN_TXBTIE_TIE10_Msk (_U_(0x1) << CAN_TXBTIE_TIE10_Pos)
#define CAN_TXBTIE_TIE11_Msk (_U_(0x1) << CAN_TXBTIE_TIE11_Pos)
#define CAN_TXBTIE_TIE12_Msk (_U_(0x1) << CAN_TXBTIE_TIE12_Pos)
#define CAN_TXBTIE_TIE13_Msk (_U_(0x1) << CAN_TXBTIE_TIE13_Pos)
#define CAN_TXBTIE_TIE14_Msk (_U_(0x1) << CAN_TXBTIE_TIE14_Pos)
#define CAN_TXBTIE_TIE15_Msk (_U_(0x1) << CAN_TXBTIE_TIE15_Pos)
#define CAN_TXBTIE_TIE16_Msk (_U_(0x1) << CAN_TXBTIE_TIE16_Pos)
#define CAN_TXBTIE_TIE17_Msk (_U_(0x1) << CAN_TXBTIE_TIE17_Pos)
#define CAN_TXBTIE_TIE18_Msk (_U_(0x1) << CAN_TXBTIE_TIE18_Pos)
#define CAN_TXBTIE_TIE19_Msk (_U_(0x1) << CAN_TXBTIE_TIE19_Pos)
#define CAN_TXBTIE_TIE20_Msk (_U_(0x1) << CAN_TXBTIE_TIE20_Pos)
#define CAN_TXBTIE_TIE21_Msk (_U_(0x1) << CAN_TXBTIE_TIE21_Pos)
#define CAN_TXBTIE_TIE22_Msk (_U_(0x1) << CAN_TXBTIE_TIE22_Pos)
#define CAN_TXBTIE_TIE23_Msk (_U_(0x1) << CAN_TXBTIE_TIE23_Pos)
#define CAN_TXBTIE_TIE24_Msk (_U_(0x1) << CAN_TXBTIE_TIE24_Pos)
#define CAN_TXBTIE_TIE25_Msk (_U_(0x1) << CAN_TXBTIE_TIE25_Pos)
#define CAN_TXBTIE_TIE26_Msk (_U_(0x1) << CAN_TXBTIE_TIE26_Pos)
#define CAN_TXBTIE_TIE27_Msk (_U_(0x1) << CAN_TXBTIE_TIE27_Pos)
#define CAN_TXBTIE_TIE28_Msk (_U_(0x1) << CAN_TXBTIE_TIE28_Pos)
#define CAN_TXBTIE_TIE29_Msk (_U_(0x1) << CAN_TXBTIE_TIE29_Pos)
#define CAN_TXBTIE_TIE30_Msk (_U_(0x1) << CAN_TXBTIE_TIE30_Pos)
#define CAN_TXBTIE_TIE31_Msk (_U_(0x1) << CAN_TXBTIE_TIE31_Pos)
#define CAN_TXBCIE_CFIE0_Msk (_U_(0x1) << CAN_TXBCIE_CFIE0_Pos)
#define CAN_TXBCIE_CFIE1_Msk (_U_(0x1) << CAN_TXBCIE_CFIE1_Pos)
#define CAN_TXBCIE_CFIE2_Msk (_U_(0x1) << CAN_TXBCIE_CFIE2_Pos)
#define CAN_TXBCIE_CFIE3_Msk (_U_(0x1) << CAN_TXBCIE_CFIE3_Pos)
#define CAN_TXBCIE_CFIE4_Msk (_U_(0x1) << CAN_TXBCIE_CFIE4_Pos)
#define CAN_TXBCIE_CFIE5_Msk (_U_(0x1) << CAN_TXBCIE_CFIE5_Pos)
#define CAN_TXBCIE_CFIE6_Msk (_U_(0x1) << CAN_TXBCIE_CFIE6_Pos)
#define CAN_TXBCIE_CFIE7_Msk (_U_(0x1) << CAN_TXBCIE_CFIE7_Pos)
#define CAN_TXBCIE_CFIE8_Msk (_U_(0x1) << CAN_TXBCIE_CFIE8_Pos)
#define CAN_TXBCIE_CFIE9_Msk (_U_(0x1) << CAN_TXBCIE_CFIE9_Pos)
#define CAN_TXBCIE_CFIE10_Msk (_U_(0x1) << CAN_TXBCIE_CFIE10_Pos)
#define CAN_TXBCIE_CFIE11_Msk (_U_(0x1) << CAN_TXBCIE_CFIE11_Pos)
#define CAN_TXBCIE_CFIE12_Msk (_U_(0x1) << CAN_TXBCIE_CFIE12_Pos)
#define CAN_TXBCIE_CFIE13_Msk (_U_(0x1) << CAN_TXBCIE_CFIE13_Pos)
#define CAN_TXBCIE_CFIE14_Msk (_U_(0x1) << CAN_TXBCIE_CFIE14_Pos)
#define CAN_TXBCIE_CFIE15_Msk (_U_(0x1) << CAN_TXBCIE_CFIE15_Pos)
#define CAN_TXBCIE_CFIE16_Msk (_U_(0x1) << CAN_TXBCIE_CFIE16_Pos)
#define CAN_TXBCIE_CFIE17_Msk (_U_(0x1) << CAN_TXBCIE_CFIE17_Pos)
#define CAN_TXBCIE_CFIE18_Msk (_U_(0x1) << CAN_TXBCIE_CFIE18_Pos)
#define CAN_TXBCIE_CFIE19_Msk (_U_(0x1) << CAN_TXBCIE_CFIE19_Pos)
