dylad/RIOT/cpu/sam0_common/include/vendor/same54/include/compat_same54.h
#define CAN_TXBCIE_CFIE20_Msk (_U_(0x1) << CAN_TXBCIE_CFIE20_Pos)
#define CAN_TXBCIE_CFIE21_Msk (_U_(0x1) << CAN_TXBCIE_CFIE21_Pos)
#define CAN_TXBCIE_CFIE22_Msk (_U_(0x1) << CAN_TXBCIE_CFIE22_Pos)
#define CAN_TXBCIE_CFIE23_Msk (_U_(0x1) << CAN_TXBCIE_CFIE23_Pos)
#define CAN_TXBCIE_CFIE24_Msk (_U_(0x1) << CAN_TXBCIE_CFIE24_Pos)
#define CAN_TXBCIE_CFIE25_Msk (_U_(0x1) << CAN_TXBCIE_CFIE25_Pos)
#define CAN_TXBCIE_CFIE26_Msk (_U_(0x1) << CAN_TXBCIE_CFIE26_Pos)
#define CAN_TXBCIE_CFIE27_Msk (_U_(0x1) << CAN_TXBCIE_CFIE27_Pos)
#define CAN_TXBCIE_CFIE28_Msk (_U_(0x1) << CAN_TXBCIE_CFIE28_Pos)
#define CAN_TXBCIE_CFIE29_Msk (_U_(0x1) << CAN_TXBCIE_CFIE29_Pos)
#define CAN_TXBCIE_CFIE30_Msk (_U_(0x1) << CAN_TXBCIE_CFIE30_Pos)
#define CAN_TXBCIE_CFIE31_Msk (_U_(0x1) << CAN_TXBCIE_CFIE31_Pos)
#define CAN_TXEFS_EFF_Msk (_U_(0x1) << CAN_TXEFS_EFF_Pos)
#define CAN_TXEFS_TEFL_Msk (_U_(0x1) << CAN_TXEFS_TEFL_Pos)
#define CAN_RXBE_0_RTR_Msk (_U_(0x1) << CAN_RXBE_0_RTR_Pos)
#define CAN_RXBE_0_XTD_Msk (_U_(0x1) << CAN_RXBE_0_XTD_Pos)
#define CAN_RXBE_0_ESI_Msk (_U_(0x1) << CAN_RXBE_0_ESI_Pos)
#define CAN_RXBE_1_BRS_Msk (_U_(0x1) << CAN_RXBE_1_BRS_Pos)
#define CAN_RXBE_1_FDF_Msk (_U_(0x1) << CAN_RXBE_1_FDF_Pos)
#define CAN_RXBE_1_ANMF_Msk (_U_(0x1) << CAN_RXBE_1_ANMF_Pos)
#define CAN_RXF0E_0_RTR_Msk (_U_(0x1) << CAN_RXF0E_0_RTR_Pos)
#define CAN_RXF0E_0_XTD_Msk (_U_(0x1) << CAN_RXF0E_0_XTD_Pos)
#define CAN_RXF0E_0_ESI_Msk (_U_(0x1) << CAN_RXF0E_0_ESI_Pos)
#define CAN_RXF0E_1_BRS_Msk (_U_(0x1) << CAN_RXF0E_1_BRS_Pos)
#define CAN_RXF0E_1_FDF_Msk (_U_(0x1) << CAN_RXF0E_1_FDF_Pos)
#define CAN_RXF0E_1_ANMF_Msk (_U_(0x1) << CAN_RXF0E_1_ANMF_Pos)
#define CAN_RXF1E_0_RTR_Msk (_U_(0x1) << CAN_RXF1E_0_RTR_Pos)
#define CAN_RXF1E_0_XTD_Msk (_U_(0x1) << CAN_RXF1E_0_XTD_Pos)
#define CAN_RXF1E_0_ESI_Msk (_U_(0x1) << CAN_RXF1E_0_ESI_Pos)
#define CAN_RXF1E_1_BRS_Msk (_U_(0x1) << CAN_RXF1E_1_BRS_Pos)
#define CAN_RXF1E_1_FDF_Msk (_U_(0x1) << CAN_RXF1E_1_FDF_Pos)
#define CAN_RXF1E_1_ANMF_Msk (_U_(0x1) << CAN_RXF1E_1_ANMF_Pos)
#define CAN_TXBE_0_RTR_Msk (_U_(0x1) << CAN_TXBE_0_RTR_Pos)
#define CAN_TXBE_0_XTD_Msk (_U_(0x1) << CAN_TXBE_0_XTD_Pos)
#define CAN_TXBE_0_ESI_Msk (_U_(0x1) << CAN_TXBE_0_ESI_Pos)
#define CAN_TXBE_1_BRS_Msk (_U_(0x1) << CAN_TXBE_1_BRS_Pos)
#define CAN_TXBE_1_FDF_Msk (_U_(0x1) << CAN_TXBE_1_FDF_Pos)
#define CAN_TXBE_1_EFC_Msk (_U_(0x1) << CAN_TXBE_1_EFC_Pos)
#define CAN_TXEFE_0_RTR_Msk (_U_(0x1) << CAN_TXEFE_0_RTR_Pos)
#define CAN_TXEFE_0_XTD_Msk (_U_(0x1) << CAN_TXEFE_0_XTD_Pos)
#define CAN_TXEFE_0_ESI_Msk (_U_(0x1) << CAN_TXEFE_0_ESI_Pos)
#define CAN_TXEFE_1_BRS_Msk (_U_(0x1) << CAN_TXEFE_1_BRS_Pos)
#define CAN_TXEFE_1_FDF_Msk (_U_(0x1) << CAN_TXEFE_1_FDF_Pos)
#define CAN_CREL_Msk CAN_CREL_MASK
#define CAN_ENDN_Msk CAN_ENDN_MASK
#define CAN_MRCFG_Msk CAN_MRCFG_MASK
#define CAN_DBTP_Msk CAN_DBTP_MASK
#define CAN_TEST_Msk CAN_TEST_MASK
#define CAN_RWD_Msk CAN_RWD_MASK
#define CAN_CCCR_Msk CAN_CCCR_MASK
#define CAN_NBTP_Msk CAN_NBTP_MASK
#define CAN_TSCC_Msk CAN_TSCC_MASK
#define CAN_TSCV_Msk CAN_TSCV_MASK
#define CAN_TOCC_Msk CAN_TOCC_MASK
#define CAN_TOCV_Msk CAN_TOCV_MASK
#define CAN_ECR_Msk CAN_ECR_MASK
#define CAN_PSR_Msk CAN_PSR_MASK
#define CAN_TDCR_Msk CAN_TDCR_MASK
#define CAN_IR_Msk CAN_IR_MASK
#define CAN_IE_Msk CAN_IE_MASK
#define CAN_ILS_Msk CAN_ILS_MASK
#define CAN_ILE_Msk CAN_ILE_MASK
#define CAN_GFC_Msk CAN_GFC_MASK
#define CAN_SIDFC_Msk CAN_SIDFC_MASK
#define CAN_XIDFC_Msk CAN_XIDFC_MASK
#define CAN_XIDAM_Msk CAN_XIDAM_MASK
#define CAN_HPMS_Msk CAN_HPMS_MASK
#define CAN_NDAT1_Msk CAN_NDAT1_MASK
#define CAN_NDAT2_Msk CAN_NDAT2_MASK
#define CAN_RXF0C_Msk CAN_RXF0C_MASK
#define CAN_RXF0S_Msk CAN_RXF0S_MASK
#define CAN_RXF0A_Msk CAN_RXF0A_MASK
#define CAN_RXBC_Msk CAN_RXBC_MASK
#define CAN_RXF1C_Msk CAN_RXF1C_MASK
#define CAN_RXF1S_Msk CAN_RXF1S_MASK
#define CAN_RXF1A_Msk CAN_RXF1A_MASK
#define CAN_RXESC_Msk CAN_RXESC_MASK
#define CAN_TXBC_Msk CAN_TXBC_MASK
#define CAN_TXFQS_Msk CAN_TXFQS_MASK
#define CAN_TXESC_Msk CAN_TXESC_MASK
#define CAN_TXBRP_Msk CAN_TXBRP_MASK
#define CAN_TXBAR_Msk CAN_TXBAR_MASK
#define CAN_TXBCR_Msk CAN_TXBCR_MASK
#define CAN_TXBTO_Msk CAN_TXBTO_MASK
#define CAN_TXBCF_Msk CAN_TXBCF_MASK
#define CAN_TXBTIE_Msk CAN_TXBTIE_MASK
#define CAN_TXBCIE_Msk CAN_TXBCIE_MASK
#define CAN_TXEFC_Msk CAN_TXEFC_MASK
#define CAN_TXEFS_Msk CAN_TXEFS_MASK
#define CAN_TXEFA_Msk CAN_TXEFA_MASK
#define CAN_RXBE_0_Msk CAN_RXBE_0_MASK
#define CAN_RXBE_1_Msk CAN_RXBE_1_MASK
#define CAN_RXBE_DATA_Msk CAN_RXBE_DATA_MASK
#define CAN_RXF0E_0_Msk CAN_RXF0E_0_MASK
#define CAN_RXF0E_1_Msk CAN_RXF0E_1_MASK
#define CAN_RXF0E_DATA_Msk CAN_RXF0E_DATA_MASK
#define CAN_RXF1E_0_Msk CAN_RXF1E_0_MASK
#define CAN_RXF1E_1_Msk CAN_RXF1E_1_MASK
#define CAN_RXF1E_DATA_Msk CAN_RXF1E_DATA_MASK
#define CAN_SIDFE_0_Msk CAN_SIDFE_0_MASK
#define CAN_TXBE_0_Msk CAN_TXBE_0_MASK
#define CAN_TXBE_1_Msk CAN_TXBE_1_MASK
#define CAN_TXBE_DATA_Msk CAN_TXBE_DATA_MASK
#define CAN_TXEFE_0_Msk CAN_TXEFE_0_MASK
#define CAN_TXEFE_1_Msk CAN_TXEFE_1_MASK
#define CAN_XIDFE_0_Msk CAN_XIDFE_0_MASK
#define CAN_XIDFE_1_Msk CAN_XIDFE_1_MASK
#define CCL_CTRL_SWRST_Msk (_U_(0x1) << CCL_CTRL_SWRST_Pos)
#define CCL_CTRL_ENABLE_Msk (_U_(0x1) << CCL_CTRL_ENABLE_Pos)
#define CCL_CTRL_RUNSTDBY_Msk (_U_(0x1) << CCL_CTRL_RUNSTDBY_Pos)
#define CCL_LUTCTRL_ENABLE_Msk (_U_(0x1) << CCL_LUTCTRL_ENABLE_Pos)
#define CCL_LUTCTRL_EDGESEL_Msk (_U_(0x1) << CCL_LUTCTRL_EDGESEL_Pos)
#define CCL_LUTCTRL_INVEI_Msk (_U_(0x1) << CCL_LUTCTRL_INVEI_Pos)
#define CCL_LUTCTRL_LUTEI_Msk (_U_(0x1) << CCL_LUTCTRL_LUTEI_Pos)
#define CCL_LUTCTRL_LUTEO_Msk (_U_(0x1) << CCL_LUTCTRL_LUTEO_Pos)
#define CCL_CTRL_Msk CCL_CTRL_MASK
#define CCL_SEQCTRL_Msk CCL_SEQCTRL_MASK
#define CCL_LUTCTRL_INSEL0_Msk CCL_LUTCTRL_INSEL0_MASK
#define CCL_LUTCTRL_INSEL1_Msk CCL_LUTCTRL_INSEL1_MASK
#define CCL_LUTCTRL_INSEL2_Msk CCL_LUTCTRL_INSEL2_MASK
#define CCL_LUTCTRL_Msk CCL_LUTCTRL_MASK
#define CMCC_TYPE_GCLK_Msk (_U_(0x1) << CMCC_TYPE_GCLK_Pos)
#define CMCC_TYPE_RRP_Msk (_U_(0x1) << CMCC_TYPE_RRP_Pos)
#define CMCC_TYPE_LCKDOWN_Msk (_U_(0x1) << CMCC_TYPE_LCKDOWN_Pos)
#define CMCC_CFG_ICDIS_Msk (_U_(0x1) << CMCC_CFG_ICDIS_Pos)
#define CMCC_CFG_DCDIS_Msk (_U_(0x1) << CMCC_CFG_DCDIS_Pos)
#define CMCC_CTRL_CEN_Msk (_U_(0x1) << CMCC_CTRL_CEN_Pos)
#define CMCC_SR_CSTS_Msk (_U_(0x1) << CMCC_SR_CSTS_Pos)
#define CMCC_MAINT0_INVALL_Msk (_U_(0x1) << CMCC_MAINT0_INVALL_Pos)
#define CMCC_MEN_MENABLE_Msk (_U_(0x1) << CMCC_MEN_MENABLE_Pos)
#define CMCC_MCTRL_SWRST_Msk (_U_(0x1) << CMCC_MCTRL_SWRST_Pos)
#define CMCC_TYPE_Msk CMCC_TYPE_MASK
#define CMCC_CFG_Msk CMCC_CFG_MASK
#define CMCC_CTRL_Msk CMCC_CTRL_MASK
#define CMCC_SR_Msk CMCC_SR_MASK
#define CMCC_LCKWAY_Msk CMCC_LCKWAY_MASK
#define CMCC_MAINT0_Msk CMCC_MAINT0_MASK
#define CMCC_MAINT1_Msk CMCC_MAINT1_MASK
#define CMCC_MCFG_Msk CMCC_MCFG_MASK
#define CMCC_MEN_Msk CMCC_MEN_MASK
#define CMCC_MCTRL_Msk CMCC_MCTRL_MASK
#define CMCC_MSR_Msk CMCC_MSR_MASK
#define DAC_CTRLA_SWRST_Msk (_U_(0x1) << DAC_CTRLA_SWRST_Pos)
#define DAC_CTRLA_ENABLE_Msk (_U_(0x1) << DAC_CTRLA_ENABLE_Pos)
#define DAC_CTRLB_DIFF_Msk (_U_(0x1) << DAC_CTRLB_DIFF_Pos)
#define DAC_EVCTRL_STARTEI0_Msk (_U_(0x1) << DAC_EVCTRL_STARTEI0_Pos)
#define DAC_EVCTRL_STARTEI1_Msk (_U_(0x1) << DAC_EVCTRL_STARTEI1_Pos)
#define DAC_EVCTRL_EMPTYEO0_Msk (_U_(0x1) << DAC_EVCTRL_EMPTYEO0_Pos)
#define DAC_EVCTRL_EMPTYEO1_Msk (_U_(0x1) << DAC_EVCTRL_EMPTYEO1_Pos)
#define DAC_EVCTRL_INVEI0_Msk (_U_(0x1) << DAC_EVCTRL_INVEI0_Pos)
#define DAC_EVCTRL_INVEI1_Msk (_U_(0x1) << DAC_EVCTRL_INVEI1_Pos)
#define DAC_EVCTRL_RESRDYEO0_Msk (_U_(0x1) << DAC_EVCTRL_RESRDYEO0_Pos)
#define DAC_EVCTRL_RESRDYEO1_Msk (_U_(0x1) << DAC_EVCTRL_RESRDYEO1_Pos)
#define DAC_INTENCLR_UNDERRUN0_Msk (_U_(0x1) << DAC_INTENCLR_UNDERRUN0_Pos)
#define DAC_INTENCLR_UNDERRUN1_Msk (_U_(0x1) << DAC_INTENCLR_UNDERRUN1_Pos)
#define DAC_INTENCLR_EMPTY0_Msk (_U_(0x1) << DAC_INTENCLR_EMPTY0_Pos)
#define DAC_INTENCLR_EMPTY1_Msk (_U_(0x1) << DAC_INTENCLR_EMPTY1_Pos)
#define DAC_INTENCLR_RESRDY0_Msk (_U_(0x1) << DAC_INTENCLR_RESRDY0_Pos)
#define DAC_INTENCLR_RESRDY1_Msk (_U_(0x1) << DAC_INTENCLR_RESRDY1_Pos)
#define DAC_INTENCLR_OVERRUN0_Msk (_U_(0x1) << DAC_INTENCLR_OVERRUN0_Pos)
#define DAC_INTENCLR_OVERRUN1_Msk (_U_(0x1) << DAC_INTENCLR_OVERRUN1_Pos)
#define DAC_INTENSET_UNDERRUN0_Msk (_U_(0x1) << DAC_INTENSET_UNDERRUN0_Pos)
#define DAC_INTENSET_UNDERRUN1_Msk (_U_(0x1) << DAC_INTENSET_UNDERRUN1_Pos)
#define DAC_INTENSET_EMPTY0_Msk (_U_(0x1) << DAC_INTENSET_EMPTY0_Pos)
#define DAC_INTENSET_EMPTY1_Msk (_U_(0x1) << DAC_INTENSET_EMPTY1_Pos)
#define DAC_INTENSET_RESRDY0_Msk (_U_(0x1) << DAC_INTENSET_RESRDY0_Pos)
#define DAC_INTENSET_RESRDY1_Msk (_U_(0x1) << DAC_INTENSET_RESRDY1_Pos)
#define DAC_INTENSET_OVERRUN0_Msk (_U_(0x1) << DAC_INTENSET_OVERRUN0_Pos)
#define DAC_INTENSET_OVERRUN1_Msk (_U_(0x1) << DAC_INTENSET_OVERRUN1_Pos)
#define DAC_INTFLAG_UNDERRUN0_Msk (_U_(0x1) << DAC_INTFLAG_UNDERRUN0_Pos)
#define DAC_INTFLAG_UNDERRUN1_Msk (_U_(0x1) << DAC_INTFLAG_UNDERRUN1_Pos)
#define DAC_INTFLAG_EMPTY0_Msk (_U_(0x1) << DAC_INTFLAG_EMPTY0_Pos)
#define DAC_INTFLAG_EMPTY1_Msk (_U_(0x1) << DAC_INTFLAG_EMPTY1_Pos)
#define DAC_INTFLAG_RESRDY0_Msk (_U_(0x1) << DAC_INTFLAG_RESRDY0_Pos)
#define DAC_INTFLAG_RESRDY1_Msk (_U_(0x1) << DAC_INTFLAG_RESRDY1_Pos)
#define DAC_INTFLAG_OVERRUN0_Msk (_U_(0x1) << DAC_INTFLAG_OVERRUN0_Pos)
#define DAC_INTFLAG_OVERRUN1_Msk (_U_(0x1) << DAC_INTFLAG_OVERRUN1_Pos)
#define DAC_STATUS_READY0_Msk (_U_(0x1) << DAC_STATUS_READY0_Pos)
#define DAC_STATUS_READY1_Msk (_U_(0x1) << DAC_STATUS_READY1_Pos)
#define DAC_STATUS_EOC0_Msk (_U_(0x1) << DAC_STATUS_EOC0_Pos)
#define DAC_STATUS_EOC1_Msk (_U_(0x1) << DAC_STATUS_EOC1_Pos)
#define DAC_SYNCBUSY_SWRST_Msk (_U_(0x1) << DAC_SYNCBUSY_SWRST_Pos)
#define DAC_SYNCBUSY_ENABLE_Msk (_U_(0x1) << DAC_SYNCBUSY_ENABLE_Pos)
#define DAC_SYNCBUSY_DATA0_Msk (_U_(0x1) << DAC_SYNCBUSY_DATA0_Pos)
#define DAC_SYNCBUSY_DATA1_Msk (_U_(0x1) << DAC_SYNCBUSY_DATA1_Pos)
#define DAC_SYNCBUSY_DATABUF0_Msk (_U_(0x1) << DAC_SYNCBUSY_DATABUF0_Pos)
#define DAC_SYNCBUSY_DATABUF1_Msk (_U_(0x1) << DAC_SYNCBUSY_DATABUF1_Pos)
#define DAC_DACCTRL_LEFTADJ_Msk (_U_(0x1) << DAC_DACCTRL_LEFTADJ_Pos)
#define DAC_DACCTRL_ENABLE_Msk (_U_(0x1) << DAC_DACCTRL_ENABLE_Pos)
#define DAC_DACCTRL_FEXT_Msk (_U_(0x1) << DAC_DACCTRL_FEXT_Pos)
#define DAC_DACCTRL_RUNSTDBY_Msk (_U_(0x1) << DAC_DACCTRL_RUNSTDBY_Pos)
#define DAC_DACCTRL_DITHER_Msk (_U_(0x1) << DAC_DACCTRL_DITHER_Pos)
#define DAC_DBGCTRL_DBGRUN_Msk (_U_(0x1) << DAC_DBGCTRL_DBGRUN_Pos)
#define DAC_CTRLA_Msk DAC_CTRLA_MASK
#define DAC_CTRLB_Msk DAC_CTRLB_MASK
#define DAC_EVCTRL_Msk DAC_EVCTRL_MASK
#define DAC_INTENCLR_Msk DAC_INTENCLR_MASK
#define DAC_INTENSET_Msk DAC_INTENSET_MASK
#define DAC_INTFLAG_Msk DAC_INTFLAG_MASK
#define DAC_STATUS_Msk DAC_STATUS_MASK
#define DAC_SYNCBUSY_Msk DAC_SYNCBUSY_MASK
#define DAC_DACCTRL_Msk DAC_DACCTRL_MASK
#define DAC_DATA_Msk DAC_DATA_MASK
#define DAC_DATABUF_Msk DAC_DATABUF_MASK
#define DAC_DBGCTRL_Msk DAC_DBGCTRL_MASK
#define DAC_RESULT_Msk DAC_RESULT_MASK
#define DSU_CTRL_SWRST_Msk (_U_(0x1) << DSU_CTRL_SWRST_Pos)
#define DSU_CTRL_CRC_Msk (_U_(0x1) << DSU_CTRL_CRC_Pos)
#define DSU_CTRL_MBIST_Msk (_U_(0x1) << DSU_CTRL_MBIST_Pos)
#define DSU_CTRL_CE_Msk (_U_(0x1) << DSU_CTRL_CE_Pos)
#define DSU_CTRL_ARR_Msk (_U_(0x1) << DSU_CTRL_ARR_Pos)
#define DSU_CTRL_SMSA_Msk (_U_(0x1) << DSU_CTRL_SMSA_Pos)
#define DSU_STATUSA_DONE_Msk (_U_(0x1) << DSU_STATUSA_DONE_Pos)
#define DSU_STATUSA_CRSTEXT_Msk (_U_(0x1) << DSU_STATUSA_CRSTEXT_Pos)
#define DSU_STATUSA_BERR_Msk (_U_(0x1) << DSU_STATUSA_BERR_Pos)
#define DSU_STATUSA_FAIL_Msk (_U_(0x1) << DSU_STATUSA_FAIL_Pos)
#define DSU_STATUSA_PERR_Msk (_U_(0x1) << DSU_STATUSA_PERR_Pos)
#define DSU_STATUSB_PROT_Msk (_U_(0x1) << DSU_STATUSB_PROT_Pos)
#define DSU_STATUSB_DBGPRES_Msk (_U_(0x1) << DSU_STATUSB_DBGPRES_Pos)
#define DSU_STATUSB_DCCD0_Msk (_U_(0x1) << DSU_STATUSB_DCCD0_Pos)
#define DSU_STATUSB_DCCD1_Msk (_U_(0x1) << DSU_STATUSB_DCCD1_Pos)
#define DSU_STATUSB_HPE_Msk (_U_(0x1) << DSU_STATUSB_HPE_Pos)
#define DSU_STATUSB_CELCK_Msk (_U_(0x1) << DSU_STATUSB_CELCK_Pos)
#define DSU_STATUSB_TDCCD0_Msk (_U_(0x1) << DSU_STATUSB_TDCCD0_Pos)
#define DSU_STATUSB_TDCCD1_Msk (_U_(0x1) << DSU_STATUSB_TDCCD1_Pos)
#define DSU_CFG_ETBRAMEN_Msk (_U_(0x1) << DSU_CFG_ETBRAMEN_Pos)
#define DSU_ENTRY0_EPRES_Msk (_U_(0x1) << DSU_ENTRY0_EPRES_Pos)
#define DSU_ENTRY0_FMT_Msk (_U_(0x1) << DSU_ENTRY0_FMT_Pos)
#define DSU_MEMTYPE_SMEMP_Msk (_U_(0x1) << DSU_MEMTYPE_SMEMP_Pos)
#define DSU_PID2_JEPU_Msk (_U_(0x1) << DSU_PID2_JEPU_Pos)
#define DSU_CTRL_Msk DSU_CTRL_MASK
#define DSU_STATUSA_Msk DSU_STATUSA_MASK
#define DSU_STATUSB_Msk DSU_STATUSB_MASK
#define DSU_ADDR_Msk DSU_ADDR_MASK
#define DSU_LENGTH_Msk DSU_LENGTH_MASK
#define DSU_DATA_Msk DSU_DATA_MASK
#define DSU_DCC_Msk DSU_DCC_MASK
#define DSU_DID_Msk DSU_DID_MASK
#define DSU_CFG_Msk DSU_CFG_MASK
#define DSU_DCFG_Msk DSU_DCFG_MASK
#define DSU_ENTRY0_Msk DSU_ENTRY0_MASK
#define DSU_ENTRY1_Msk DSU_ENTRY1_MASK
#define DSU_END_Msk DSU_END_MASK
#define DSU_MEMTYPE_Msk DSU_MEMTYPE_MASK
#define DSU_PID4_Msk DSU_PID4_MASK
#define DSU_PID5_Msk DSU_PID5_MASK
#define DSU_PID6_Msk DSU_PID6_MASK
#define DSU_PID7_Msk DSU_PID7_MASK
#define DSU_PID0_Msk DSU_PID0_MASK
#define DSU_PID1_Msk DSU_PID1_MASK
#define DSU_PID2_Msk DSU_PID2_MASK
#define DSU_PID3_Msk DSU_PID3_MASK
#define DSU_CID0_Msk DSU_CID0_MASK
#define DSU_CID1_Msk DSU_CID1_MASK
#define DSU_CID2_Msk DSU_CID2_MASK
#define DSU_CID3_Msk DSU_CID3_MASK
#define GCLK_CTRLA_SWRST_Msk (_U_(0x1) << GCLK_CTRLA_SWRST_Pos)
#define GCLK_SYNCBUSY_SWRST_Msk (_U_(0x1) << GCLK_SYNCBUSY_SWRST_Pos)
#define GCLK_SYNCBUSY_GENCTRL0_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL0_Pos)
#define GCLK_SYNCBUSY_GENCTRL1_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL1_Pos)
#define GCLK_SYNCBUSY_GENCTRL2_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL2_Pos)
#define GCLK_SYNCBUSY_GENCTRL3_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL3_Pos)
#define GCLK_SYNCBUSY_GENCTRL4_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL4_Pos)
#define GCLK_SYNCBUSY_GENCTRL5_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL5_Pos)
#define GCLK_SYNCBUSY_GENCTRL6_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL6_Pos)
#define GCLK_SYNCBUSY_GENCTRL7_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL7_Pos)
#define GCLK_SYNCBUSY_GENCTRL8_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL8_Pos)
#define GCLK_SYNCBUSY_GENCTRL9_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL9_Pos)
#define GCLK_SYNCBUSY_GENCTRL10_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL10_Pos)
#define GCLK_SYNCBUSY_GENCTRL11_Msk (_U_(0x1) << GCLK_SYNCBUSY_GENCTRL11_Pos)
#define GCLK_GENCTRL_GENEN_Msk (_U_(0x1) << GCLK_GENCTRL_GENEN_Pos)
#define GCLK_GENCTRL_IDC_Msk (_U_(0x1) << GCLK_GENCTRL_IDC_Pos)
#define GCLK_GENCTRL_OOV_Msk (_U_(0x1) << GCLK_GENCTRL_OOV_Pos)
#define GCLK_GENCTRL_OE_Msk (_U_(0x1) << GCLK_GENCTRL_OE_Pos)
#define GCLK_GENCTRL_DIVSEL_Msk (_U_(0x1) << GCLK_GENCTRL_DIVSEL_Pos)
#define GCLK_GENCTRL_RUNSTDBY_Msk (_U_(0x1) << GCLK_GENCTRL_RUNSTDBY_Pos)
#define GCLK_PCHCTRL_CHEN_Msk (_U_(0x1) << GCLK_PCHCTRL_CHEN_Pos)
#define GCLK_PCHCTRL_WRTLOCK_Msk (_U_(0x1) << GCLK_PCHCTRL_WRTLOCK_Pos)
#define GCLK_CTRLA_Msk GCLK_CTRLA_MASK
#define GCLK_SYNCBUSY_Msk GCLK_SYNCBUSY_MASK
#define GCLK_GENCTRL_Msk GCLK_GENCTRL_MASK
#define GCLK_PCHCTRL_Msk GCLK_PCHCTRL_MASK
#define GMAC_NCR_LBL_Msk (_U_(0x1) << GMAC_NCR_LBL_Pos)
#define GMAC_NCR_RXEN_Msk (_U_(0x1) << GMAC_NCR_RXEN_Pos)
#define GMAC_NCR_TXEN_Msk (_U_(0x1) << GMAC_NCR_TXEN_Pos)
#define GMAC_NCR_MPE_Msk (_U_(0x1) << GMAC_NCR_MPE_Pos)
#define GMAC_NCR_CLRSTAT_Msk (_U_(0x1) << GMAC_NCR_CLRSTAT_Pos)
#define GMAC_NCR_INCSTAT_Msk (_U_(0x1) << GMAC_NCR_INCSTAT_Pos)
#define GMAC_NCR_WESTAT_Msk (_U_(0x1) << GMAC_NCR_WESTAT_Pos)
#define GMAC_NCR_BP_Msk (_U_(0x1) << GMAC_NCR_BP_Pos)
#define GMAC_NCR_TSTART_Msk (_U_(0x1) << GMAC_NCR_TSTART_Pos)
#define GMAC_NCR_THALT_Msk (_U_(0x1) << GMAC_NCR_THALT_Pos)
#define GMAC_NCR_TXPF_Msk (_U_(0x1) << GMAC_NCR_TXPF_Pos)
#define GMAC_NCR_TXZQPF_Msk (_U_(0x1) << GMAC_NCR_TXZQPF_Pos)
#define GMAC_NCR_SRTSM_Msk (_U_(0x1) << GMAC_NCR_SRTSM_Pos)
#define GMAC_NCR_ENPBPR_Msk (_U_(0x1) << GMAC_NCR_ENPBPR_Pos)
#define GMAC_NCR_TXPBPF_Msk (_U_(0x1) << GMAC_NCR_TXPBPF_Pos)
#define GMAC_NCR_FNP_Msk (_U_(0x1) << GMAC_NCR_FNP_Pos)
#define GMAC_NCR_LPI_Msk (_U_(0x1) << GMAC_NCR_LPI_Pos)
#define GMAC_NCFGR_SPD_Msk (_U_(0x1) << GMAC_NCFGR_SPD_Pos)
#define GMAC_NCFGR_FD_Msk (_U_(0x1) << GMAC_NCFGR_FD_Pos)
#define GMAC_NCFGR_DNVLAN_Msk (_U_(0x1) << GMAC_NCFGR_DNVLAN_Pos)
#define GMAC_NCFGR_JFRAME_Msk (_U_(0x1) << GMAC_NCFGR_JFRAME_Pos)
#define GMAC_NCFGR_CAF_Msk (_U_(0x1) << GMAC_NCFGR_CAF_Pos)
#define GMAC_NCFGR_NBC_Msk (_U_(0x1) << GMAC_NCFGR_NBC_Pos)
#define GMAC_NCFGR_MTIHEN_Msk (_U_(0x1) << GMAC_NCFGR_MTIHEN_Pos)
#define GMAC_NCFGR_UNIHEN_Msk (_U_(0x1) << GMAC_NCFGR_UNIHEN_Pos)
#define GMAC_NCFGR_MAXFS_Msk (_U_(0x1) << GMAC_NCFGR_MAXFS_Pos)
#define GMAC_NCFGR_RTY_Msk (_U_(0x1) << GMAC_NCFGR_RTY_Pos)
#define GMAC_NCFGR_PEN_Msk (_U_(0x1) << GMAC_NCFGR_PEN_Pos)
#define GMAC_NCFGR_LFERD_Msk (_U_(0x1) << GMAC_NCFGR_LFERD_Pos)
#define GMAC_NCFGR_RFCS_Msk (_U_(0x1) << GMAC_NCFGR_RFCS_Pos)
#define GMAC_NCFGR_DCPF_Msk (_U_(0x1) << GMAC_NCFGR_DCPF_Pos)
#define GMAC_NCFGR_RXCOEN_Msk (_U_(0x1) << GMAC_NCFGR_RXCOEN_Pos)
#define GMAC_NCFGR_EFRHD_Msk (_U_(0x1) << GMAC_NCFGR_EFRHD_Pos)
#define GMAC_NCFGR_IRXFCS_Msk (_U_(0x1) << GMAC_NCFGR_IRXFCS_Pos)
#define GMAC_NCFGR_IPGSEN_Msk (_U_(0x1) << GMAC_NCFGR_IPGSEN_Pos)
#define GMAC_NCFGR_RXBP_Msk (_U_(0x1) << GMAC_NCFGR_RXBP_Pos)
#define GMAC_NCFGR_IRXER_Msk (_U_(0x1) << GMAC_NCFGR_IRXER_Pos)
#define GMAC_NSR_MDIO_Msk (_U_(0x1) << GMAC_NSR_MDIO_Pos)
#define GMAC_NSR_IDLE_Msk (_U_(0x1) << GMAC_NSR_IDLE_Pos)
#define GMAC_UR_MII_Msk (_U_(0x1) << GMAC_UR_MII_Pos)
#define GMAC_DCFGR_ESMA_Msk (_U_(0x1) << GMAC_DCFGR_ESMA_Pos)
#define GMAC_DCFGR_ESPA_Msk (_U_(0x1) << GMAC_DCFGR_ESPA_Pos)
#define GMAC_DCFGR_TXPBMS_Msk (_U_(0x1) << GMAC_DCFGR_TXPBMS_Pos)
#define GMAC_DCFGR_TXCOEN_Msk (_U_(0x1) << GMAC_DCFGR_TXCOEN_Pos)
#define GMAC_DCFGR_DDRP_Msk (_U_(0x1) << GMAC_DCFGR_DDRP_Pos)
#define GMAC_TSR_UBR_Msk (_U_(0x1) << GMAC_TSR_UBR_Pos)
#define GMAC_TSR_COL_Msk (_U_(0x1) << GMAC_TSR_COL_Pos)
#define GMAC_TSR_RLE_Msk (_U_(0x1) << GMAC_TSR_RLE_Pos)
#define GMAC_TSR_TXGO_Msk (_U_(0x1) << GMAC_TSR_TXGO_Pos)
#define GMAC_TSR_TFC_Msk (_U_(0x1) << GMAC_TSR_TFC_Pos)
#define GMAC_TSR_TXCOMP_Msk (_U_(0x1) << GMAC_TSR_TXCOMP_Pos)
#define GMAC_TSR_UND_Msk (_U_(0x1) << GMAC_TSR_UND_Pos)
#define GMAC_TSR_HRESP_Msk (_U_(0x1) << GMAC_TSR_HRESP_Pos)
#define GMAC_RSR_BNA_Msk (_U_(0x1) << GMAC_RSR_BNA_Pos)
#define GMAC_RSR_REC_Msk (_U_(0x1) << GMAC_RSR_REC_Pos)
#define GMAC_RSR_RXOVR_Msk (_U_(0x1) << GMAC_RSR_RXOVR_Pos)
#define GMAC_RSR_HNO_Msk (_U_(0x1) << GMAC_RSR_HNO_Pos)
#define GMAC_ISR_MFS_Msk (_U_(0x1) << GMAC_ISR_MFS_Pos)
#define GMAC_ISR_RCOMP_Msk (_U_(0x1) << GMAC_ISR_RCOMP_Pos)
#define GMAC_ISR_RXUBR_Msk (_U_(0x1) << GMAC_ISR_RXUBR_Pos)
#define GMAC_ISR_TXUBR_Msk (_U_(0x1) << GMAC_ISR_TXUBR_Pos)
#define GMAC_ISR_TUR_Msk (_U_(0x1) << GMAC_ISR_TUR_Pos)
#define GMAC_ISR_RLEX_Msk (_U_(0x1) << GMAC_ISR_RLEX_Pos)
#define GMAC_ISR_TFC_Msk (_U_(0x1) << GMAC_ISR_TFC_Pos)
#define GMAC_ISR_TCOMP_Msk (_U_(0x1) << GMAC_ISR_TCOMP_Pos)
#define GMAC_ISR_ROVR_Msk (_U_(0x1) << GMAC_ISR_ROVR_Pos)
#define GMAC_ISR_HRESP_Msk (_U_(0x1) << GMAC_ISR_HRESP_Pos)
#define GMAC_ISR_PFNZ_Msk (_U_(0x1) << GMAC_ISR_PFNZ_Pos)
#define GMAC_ISR_PTZ_Msk (_U_(0x1) << GMAC_ISR_PTZ_Pos)
#define GMAC_ISR_PFTR_Msk (_U_(0x1) << GMAC_ISR_PFTR_Pos)
#define GMAC_ISR_DRQFR_Msk (_U_(0x1) << GMAC_ISR_DRQFR_Pos)
#define GMAC_ISR_SFR_Msk (_U_(0x1) << GMAC_ISR_SFR_Pos)
#define GMAC_ISR_DRQFT_Msk (_U_(0x1) << GMAC_ISR_DRQFT_Pos)
#define GMAC_ISR_SFT_Msk (_U_(0x1) << GMAC_ISR_SFT_Pos)
#define GMAC_ISR_PDRQFR_Msk (_U_(0x1) << GMAC_ISR_PDRQFR_Pos)
#define GMAC_ISR_PDRSFR_Msk (_U_(0x1) << GMAC_ISR_PDRSFR_Pos)
#define GMAC_ISR_PDRQFT_Msk (_U_(0x1) << GMAC_ISR_PDRQFT_Pos)
#define GMAC_ISR_PDRSFT_Msk (_U_(0x1) << GMAC_ISR_PDRSFT_Pos)
#define GMAC_ISR_SRI_Msk (_U_(0x1) << GMAC_ISR_SRI_Pos)
#define GMAC_ISR_WOL_Msk (_U_(0x1) << GMAC_ISR_WOL_Pos)
#define GMAC_ISR_TSUCMP_Msk (_U_(0x1) << GMAC_ISR_TSUCMP_Pos)
#define GMAC_IER_MFS_Msk (_U_(0x1) << GMAC_IER_MFS_Pos)
#define GMAC_IER_RCOMP_Msk (_U_(0x1) << GMAC_IER_RCOMP_Pos)
#define GMAC_IER_RXUBR_Msk (_U_(0x1) << GMAC_IER_RXUBR_Pos)
#define GMAC_IER_TXUBR_Msk (_U_(0x1) << GMAC_IER_TXUBR_Pos)
#define GMAC_IER_TUR_Msk (_U_(0x1) << GMAC_IER_TUR_Pos)
#define GMAC_IER_RLEX_Msk (_U_(0x1) << GMAC_IER_RLEX_Pos)
#define GMAC_IER_TFC_Msk (_U_(0x1) << GMAC_IER_TFC_Pos)
#define GMAC_IER_TCOMP_Msk (_U_(0x1) << GMAC_IER_TCOMP_Pos)
#define GMAC_IER_ROVR_Msk (_U_(0x1) << GMAC_IER_ROVR_Pos)
#define GMAC_IER_HRESP_Msk (_U_(0x1) << GMAC_IER_HRESP_Pos)
#define GMAC_IER_PFNZ_Msk (_U_(0x1) << GMAC_IER_PFNZ_Pos)
#define GMAC_IER_PTZ_Msk (_U_(0x1) << GMAC_IER_PTZ_Pos)
#define GMAC_IER_PFTR_Msk (_U_(0x1) << GMAC_IER_PFTR_Pos)
#define GMAC_IER_EXINT_Msk (_U_(0x1) << GMAC_IER_EXINT_Pos)
#define GMAC_IER_DRQFR_Msk (_U_(0x1) << GMAC_IER_DRQFR_Pos)
#define GMAC_IER_SFR_Msk (_U_(0x1) << GMAC_IER_SFR_Pos)
#define GMAC_IER_DRQFT_Msk (_U_(0x1) << GMAC_IER_DRQFT_Pos)
#define GMAC_IER_SFT_Msk (_U_(0x1) << GMAC_IER_SFT_Pos)
#define GMAC_IER_PDRQFR_Msk (_U_(0x1) << GMAC_IER_PDRQFR_Pos)
#define GMAC_IER_PDRSFR_Msk (_U_(0x1) << GMAC_IER_PDRSFR_Pos)
#define GMAC_IER_PDRQFT_Msk (_U_(0x1) << GMAC_IER_PDRQFT_Pos)
#define GMAC_IER_PDRSFT_Msk (_U_(0x1) << GMAC_IER_PDRSFT_Pos)
#define GMAC_IER_SRI_Msk (_U_(0x1) << GMAC_IER_SRI_Pos)
#define GMAC_IER_WOL_Msk (_U_(0x1) << GMAC_IER_WOL_Pos)
#define GMAC_IER_TSUCMP_Msk (_U_(0x1) << GMAC_IER_TSUCMP_Pos)
#define GMAC_IDR_MFS_Msk (_U_(0x1) << GMAC_IDR_MFS_Pos)
#define GMAC_IDR_RCOMP_Msk (_U_(0x1) << GMAC_IDR_RCOMP_Pos)
#define GMAC_IDR_RXUBR_Msk (_U_(0x1) << GMAC_IDR_RXUBR_Pos)
#define GMAC_IDR_TXUBR_Msk (_U_(0x1) << GMAC_IDR_TXUBR_Pos)
#define GMAC_IDR_TUR_Msk (_U_(0x1) << GMAC_IDR_TUR_Pos)
#define GMAC_IDR_RLEX_Msk (_U_(0x1) << GMAC_IDR_RLEX_Pos)
#define GMAC_IDR_TFC_Msk (_U_(0x1) << GMAC_IDR_TFC_Pos)
#define GMAC_IDR_TCOMP_Msk (_U_(0x1) << GMAC_IDR_TCOMP_Pos)
#define GMAC_IDR_ROVR_Msk (_U_(0x1) << GMAC_IDR_ROVR_Pos)
#define GMAC_IDR_HRESP_Msk (_U_(0x1) << GMAC_IDR_HRESP_Pos)
#define GMAC_IDR_PFNZ_Msk (_U_(0x1) << GMAC_IDR_PFNZ_Pos)
#define GMAC_IDR_PTZ_Msk (_U_(0x1) << GMAC_IDR_PTZ_Pos)
#define GMAC_IDR_PFTR_Msk (_U_(0x1) << GMAC_IDR_PFTR_Pos)
#define GMAC_IDR_EXINT_Msk (_U_(0x1) << GMAC_IDR_EXINT_Pos)
#define GMAC_IDR_DRQFR_Msk (_U_(0x1) << GMAC_IDR_DRQFR_Pos)
#define GMAC_IDR_SFR_Msk (_U_(0x1) << GMAC_IDR_SFR_Pos)
#define GMAC_IDR_DRQFT_Msk (_U_(0x1) << GMAC_IDR_DRQFT_Pos)
#define GMAC_IDR_SFT_Msk (_U_(0x1) << GMAC_IDR_SFT_Pos)
#define GMAC_IDR_PDRQFR_Msk (_U_(0x1) << GMAC_IDR_PDRQFR_Pos)
#define GMAC_IDR_PDRSFR_Msk (_U_(0x1) << GMAC_IDR_PDRSFR_Pos)
#define GMAC_IDR_PDRQFT_Msk (_U_(0x1) << GMAC_IDR_PDRQFT_Pos)
#define GMAC_IDR_PDRSFT_Msk (_U_(0x1) << GMAC_IDR_PDRSFT_Pos)
#define GMAC_IDR_SRI_Msk (_U_(0x1) << GMAC_IDR_SRI_Pos)
#define GMAC_IDR_WOL_Msk (_U_(0x1) << GMAC_IDR_WOL_Pos)
#define GMAC_IDR_TSUCMP_Msk (_U_(0x1) << GMAC_IDR_TSUCMP_Pos)
#define GMAC_IMR_MFS_Msk (_U_(0x1) << GMAC_IMR_MFS_Pos)
#define GMAC_IMR_RCOMP_Msk (_U_(0x1) << GMAC_IMR_RCOMP_Pos)
#define GMAC_IMR_RXUBR_Msk (_U_(0x1) << GMAC_IMR_RXUBR_Pos)
#define GMAC_IMR_TXUBR_Msk (_U_(0x1) << GMAC_IMR_TXUBR_Pos)
#define GMAC_IMR_TUR_Msk (_U_(0x1) << GMAC_IMR_TUR_Pos)
#define GMAC_IMR_RLEX_Msk (_U_(0x1) << GMAC_IMR_RLEX_Pos)
#define GMAC_IMR_TFC_Msk (_U_(0x1) << GMAC_IMR_TFC_Pos)
#define GMAC_IMR_TCOMP_Msk (_U_(0x1) << GMAC_IMR_TCOMP_Pos)
#define GMAC_IMR_ROVR_Msk (_U_(0x1) << GMAC_IMR_ROVR_Pos)
#define GMAC_IMR_HRESP_Msk (_U_(0x1) << GMAC_IMR_HRESP_Pos)
#define GMAC_IMR_PFNZ_Msk (_U_(0x1) << GMAC_IMR_PFNZ_Pos)
#define GMAC_IMR_PTZ_Msk (_U_(0x1) << GMAC_IMR_PTZ_Pos)
#define GMAC_IMR_PFTR_Msk (_U_(0x1) << GMAC_IMR_PFTR_Pos)
#define GMAC_IMR_EXINT_Msk (_U_(0x1) << GMAC_IMR_EXINT_Pos)
#define GMAC_IMR_DRQFR_Msk (_U_(0x1) << GMAC_IMR_DRQFR_Pos)
#define GMAC_IMR_SFR_Msk (_U_(0x1) << GMAC_IMR_SFR_Pos)
#define GMAC_IMR_DRQFT_Msk (_U_(0x1) << GMAC_IMR_DRQFT_Pos)
