dylad/RIOT/cpu/sam0_common/include/vendor/same54/include/compat_same54.h
#define GMAC_IMR_SFT_Msk (_U_(0x1) << GMAC_IMR_SFT_Pos)
#define GMAC_IMR_PDRQFR_Msk (_U_(0x1) << GMAC_IMR_PDRQFR_Pos)
#define GMAC_IMR_PDRSFR_Msk (_U_(0x1) << GMAC_IMR_PDRSFR_Pos)
#define GMAC_IMR_PDRQFT_Msk (_U_(0x1) << GMAC_IMR_PDRQFT_Pos)
#define GMAC_IMR_PDRSFT_Msk (_U_(0x1) << GMAC_IMR_PDRSFT_Pos)
#define GMAC_IMR_SRI_Msk (_U_(0x1) << GMAC_IMR_SRI_Pos)
#define GMAC_IMR_WOL_Msk (_U_(0x1) << GMAC_IMR_WOL_Pos)
#define GMAC_IMR_TSUCMP_Msk (_U_(0x1) << GMAC_IMR_TSUCMP_Pos)
#define GMAC_MAN_CLTTO_Msk (_U_(0x1) << GMAC_MAN_CLTTO_Pos)
#define GMAC_MAN_WZO_Msk (_U_(0x1) << GMAC_MAN_WZO_Pos)
#define GMAC_TPSF_ENTXP_Msk (_U_(0x1) << GMAC_TPSF_ENTXP_Pos)
#define GMAC_RPSF_ENRXP_Msk (_U_(0x1) << GMAC_RPSF_ENRXP_Pos)
#define GMAC_WOL_MAG_Msk (_U_(0x1) << GMAC_WOL_MAG_Pos)
#define GMAC_WOL_ARP_Msk (_U_(0x1) << GMAC_WOL_ARP_Pos)
#define GMAC_WOL_SA1_Msk (_U_(0x1) << GMAC_WOL_SA1_Pos)
#define GMAC_WOL_MTI_Msk (_U_(0x1) << GMAC_WOL_MTI_Pos)
#define GMAC_SVLAN_ESVLAN_Msk (_U_(0x1) << GMAC_SVLAN_ESVLAN_Pos)
#define GMAC_TA_ADJ_Msk (_U_(0x1) << GMAC_TA_ADJ_Pos)
#define GMAC_NCR_Msk GMAC_NCR_MASK
#define GMAC_NCFGR_Msk GMAC_NCFGR_MASK
#define GMAC_NSR_Msk GMAC_NSR_MASK
#define GMAC_UR_Msk GMAC_UR_MASK
#define GMAC_DCFGR_Msk GMAC_DCFGR_MASK
#define GMAC_TSR_Msk GMAC_TSR_MASK
#define GMAC_RBQB_Msk GMAC_RBQB_MASK
#define GMAC_TBQB_Msk GMAC_TBQB_MASK
#define GMAC_RSR_Msk GMAC_RSR_MASK
#define GMAC_ISR_Msk GMAC_ISR_MASK
#define GMAC_IER_Msk GMAC_IER_MASK
#define GMAC_IDR_Msk GMAC_IDR_MASK
#define GMAC_IMR_Msk GMAC_IMR_MASK
#define GMAC_MAN_Msk GMAC_MAN_MASK
#define GMAC_RPQ_Msk GMAC_RPQ_MASK
#define GMAC_TPQ_Msk GMAC_TPQ_MASK
#define GMAC_TPSF_Msk GMAC_TPSF_MASK
#define GMAC_RPSF_Msk GMAC_RPSF_MASK
#define GMAC_RJFML_Msk GMAC_RJFML_MASK
#define GMAC_HRB_Msk GMAC_HRB_MASK
#define GMAC_HRT_Msk GMAC_HRT_MASK
#define GMAC_SAB_Msk GMAC_SAB_MASK
#define GMAC_SAT_Msk GMAC_SAT_MASK
#define GMAC_TIDM_Msk GMAC_TIDM_MASK
#define GMAC_WOL_Msk GMAC_WOL_MASK
#define GMAC_IPGS_Msk GMAC_IPGS_MASK
#define GMAC_SVLAN_Msk GMAC_SVLAN_MASK
#define GMAC_TPFCP_Msk GMAC_TPFCP_MASK
#define GMAC_SAMB1_Msk GMAC_SAMB1_MASK
#define GMAC_SAMT1_Msk GMAC_SAMT1_MASK
#define GMAC_NSC_Msk GMAC_NSC_MASK
#define GMAC_SCL_Msk GMAC_SCL_MASK
#define GMAC_SCH_Msk GMAC_SCH_MASK
#define GMAC_EFTSH_Msk GMAC_EFTSH_MASK
#define GMAC_EFRSH_Msk GMAC_EFRSH_MASK
#define GMAC_PEFTSH_Msk GMAC_PEFTSH_MASK
#define GMAC_PEFRSH_Msk GMAC_PEFRSH_MASK
#define GMAC_OTLO_Msk GMAC_OTLO_MASK
#define GMAC_OTHI_Msk GMAC_OTHI_MASK
#define GMAC_FT_Msk GMAC_FT_MASK
#define GMAC_BCFT_Msk GMAC_BCFT_MASK
#define GMAC_MFT_Msk GMAC_MFT_MASK
#define GMAC_PFT_Msk GMAC_PFT_MASK
#define GMAC_BFT64_Msk GMAC_BFT64_MASK
#define GMAC_TBFT127_Msk GMAC_TBFT127_MASK
#define GMAC_TBFT255_Msk GMAC_TBFT255_MASK
#define GMAC_TBFT511_Msk GMAC_TBFT511_MASK
#define GMAC_TBFT1023_Msk GMAC_TBFT1023_MASK
#define GMAC_TBFT1518_Msk GMAC_TBFT1518_MASK
#define GMAC_GTBFT1518_Msk GMAC_GTBFT1518_MASK
#define GMAC_TUR_Msk GMAC_TUR_MASK
#define GMAC_SCF_Msk GMAC_SCF_MASK
#define GMAC_MCF_Msk GMAC_MCF_MASK
#define GMAC_EC_Msk GMAC_EC_MASK
#define GMAC_LC_Msk GMAC_LC_MASK
#define GMAC_DTF_Msk GMAC_DTF_MASK
#define GMAC_CSE_Msk GMAC_CSE_MASK
#define GMAC_ORLO_Msk GMAC_ORLO_MASK
#define GMAC_ORHI_Msk GMAC_ORHI_MASK
#define GMAC_FR_Msk GMAC_FR_MASK
#define GMAC_BCFR_Msk GMAC_BCFR_MASK
#define GMAC_MFR_Msk GMAC_MFR_MASK
#define GMAC_PFR_Msk GMAC_PFR_MASK
#define GMAC_BFR64_Msk GMAC_BFR64_MASK
#define GMAC_TBFR127_Msk GMAC_TBFR127_MASK
#define GMAC_TBFR255_Msk GMAC_TBFR255_MASK
#define GMAC_TBFR511_Msk GMAC_TBFR511_MASK
#define GMAC_TBFR1023_Msk GMAC_TBFR1023_MASK
#define GMAC_TBFR1518_Msk GMAC_TBFR1518_MASK
#define GMAC_TMXBFR_Msk GMAC_TMXBFR_MASK
#define GMAC_UFR_Msk GMAC_UFR_MASK
#define GMAC_OFR_Msk GMAC_OFR_MASK
#define GMAC_JR_Msk GMAC_JR_MASK
#define GMAC_FCSE_Msk GMAC_FCSE_MASK
#define GMAC_LFFE_Msk GMAC_LFFE_MASK
#define GMAC_RSE_Msk GMAC_RSE_MASK
#define GMAC_AE_Msk GMAC_AE_MASK
#define GMAC_RRE_Msk GMAC_RRE_MASK
#define GMAC_ROE_Msk GMAC_ROE_MASK
#define GMAC_IHCE_Msk GMAC_IHCE_MASK
#define GMAC_TCE_Msk GMAC_TCE_MASK
#define GMAC_UCE_Msk GMAC_UCE_MASK
#define GMAC_TISUBN_Msk GMAC_TISUBN_MASK
#define GMAC_TSH_Msk GMAC_TSH_MASK
#define GMAC_TSSSL_Msk GMAC_TSSSL_MASK
#define GMAC_TSSN_Msk GMAC_TSSN_MASK
#define GMAC_TSL_Msk GMAC_TSL_MASK
#define GMAC_TN_Msk GMAC_TN_MASK
#define GMAC_TA_Msk GMAC_TA_MASK
#define GMAC_TI_Msk GMAC_TI_MASK
#define GMAC_EFTSL_Msk GMAC_EFTSL_MASK
#define GMAC_EFTN_Msk GMAC_EFTN_MASK
#define GMAC_EFRSL_Msk GMAC_EFRSL_MASK
#define GMAC_EFRN_Msk GMAC_EFRN_MASK
#define GMAC_PEFTSL_Msk GMAC_PEFTSL_MASK
#define GMAC_PEFTN_Msk GMAC_PEFTN_MASK
#define GMAC_PEFRSL_Msk GMAC_PEFRSL_MASK
#define GMAC_PEFRN_Msk GMAC_PEFRN_MASK
#define GMAC_RLPITR_Msk GMAC_RLPITR_MASK
#define GMAC_RLPITI_Msk GMAC_RLPITI_MASK
#define GMAC_TLPITR_Msk GMAC_TLPITR_MASK
#define GMAC_TLPITI_Msk GMAC_TLPITI_MASK
#define HMATRIXB_PRAS_Msk HMATRIXB_PRAS_MASK
#define HMATRIXB_PRBS_Msk HMATRIXB_PRBS_MASK
#define ICM_CFG_WBDIS_Msk (_U_(0x1) << ICM_CFG_WBDIS_Pos)
#define ICM_CFG_EOMDIS_Msk (_U_(0x1) << ICM_CFG_EOMDIS_Pos)
#define ICM_CFG_SLBDIS_Msk (_U_(0x1) << ICM_CFG_SLBDIS_Pos)
#define ICM_CFG_ASCD_Msk (_U_(0x1) << ICM_CFG_ASCD_Pos)
#define ICM_CFG_DUALBUFF_Msk (_U_(0x1) << ICM_CFG_DUALBUFF_Pos)
#define ICM_CFG_UIHASH_Msk (_U_(0x1) << ICM_CFG_UIHASH_Pos)
#define ICM_CTRL_ENABLE_Msk (_U_(0x1) << ICM_CTRL_ENABLE_Pos)
#define ICM_CTRL_DISABLE_Msk (_U_(0x1) << ICM_CTRL_DISABLE_Pos)
#define ICM_CTRL_SWRST_Msk (_U_(0x1) << ICM_CTRL_SWRST_Pos)
#define ICM_SR_ENABLE_Msk (_U_(0x1) << ICM_SR_ENABLE_Pos)
#define ICM_IER_URAD_Msk (_U_(0x1) << ICM_IER_URAD_Pos)
#define ICM_IDR_URAD_Msk (_U_(0x1) << ICM_IDR_URAD_Pos)
#define ICM_IMR_URAD_Msk (_U_(0x1) << ICM_IMR_URAD_Pos)
#define ICM_ISR_URAD_Msk (_U_(0x1) << ICM_ISR_URAD_Pos)
#define ICM_RCFG_CDWBN_Msk (_U_(0x1) << ICM_RCFG_CDWBN_Pos)
#define ICM_RCFG_WRAP_Msk (_U_(0x1) << ICM_RCFG_WRAP_Pos)
#define ICM_RCFG_EOM_Msk (_U_(0x1) << ICM_RCFG_EOM_Pos)
#define ICM_RCFG_RHIEN_Msk (_U_(0x1) << ICM_RCFG_RHIEN_Pos)
#define ICM_RCFG_DMIEN_Msk (_U_(0x1) << ICM_RCFG_DMIEN_Pos)
#define ICM_RCFG_BEIEN_Msk (_U_(0x1) << ICM_RCFG_BEIEN_Pos)
#define ICM_RCFG_WCIEN_Msk (_U_(0x1) << ICM_RCFG_WCIEN_Pos)
#define ICM_RCFG_ECIEN_Msk (_U_(0x1) << ICM_RCFG_ECIEN_Pos)
#define ICM_RCFG_SUIEN_Msk (_U_(0x1) << ICM_RCFG_SUIEN_Pos)
#define ICM_RCFG_PROCDLY_Msk (_U_(0x1) << ICM_RCFG_PROCDLY_Pos)
#define ICM_CFG_Msk ICM_CFG_MASK
#define ICM_CTRL_Msk ICM_CTRL_MASK
#define ICM_SR_Msk ICM_SR_MASK
#define ICM_IER_Msk ICM_IER_MASK
#define ICM_IDR_Msk ICM_IDR_MASK
#define ICM_IMR_Msk ICM_IMR_MASK
#define ICM_ISR_Msk ICM_ISR_MASK
#define ICM_UASR_Msk ICM_UASR_MASK
#define ICM_DSCR_Msk ICM_DSCR_MASK
#define ICM_HASH_Msk ICM_HASH_MASK
#define ICM_UIHVAL_Msk ICM_UIHVAL_MASK
#define ICM_RADDR_Msk ICM_RADDR_MASK
#define ICM_RCFG_Msk ICM_RCFG_MASK
#define ICM_RCTRL_Msk ICM_RCTRL_MASK
#define ICM_RNEXT_Msk ICM_RNEXT_MASK
#define PCC_MR_PCEN_Msk (_U_(0x1) << PCC_MR_PCEN_Pos)
#define PCC_MR_SCALE_Msk (_U_(0x1) << PCC_MR_SCALE_Pos)
#define PCC_MR_ALWYS_Msk (_U_(0x1) << PCC_MR_ALWYS_Pos)
#define PCC_MR_HALFS_Msk (_U_(0x1) << PCC_MR_HALFS_Pos)
#define PCC_MR_FRSTS_Msk (_U_(0x1) << PCC_MR_FRSTS_Pos)
#define PCC_IER_DRDY_Msk (_U_(0x1) << PCC_IER_DRDY_Pos)
#define PCC_IER_OVRE_Msk (_U_(0x1) << PCC_IER_OVRE_Pos)
#define PCC_IDR_DRDY_Msk (_U_(0x1) << PCC_IDR_DRDY_Pos)
#define PCC_IDR_OVRE_Msk (_U_(0x1) << PCC_IDR_OVRE_Pos)
#define PCC_IMR_DRDY_Msk (_U_(0x1) << PCC_IMR_DRDY_Pos)
#define PCC_IMR_OVRE_Msk (_U_(0x1) << PCC_IMR_OVRE_Pos)
#define PCC_ISR_DRDY_Msk (_U_(0x1) << PCC_ISR_DRDY_Pos)
#define PCC_ISR_OVRE_Msk (_U_(0x1) << PCC_ISR_OVRE_Pos)
#define PCC_WPMR_WPEN_Msk (_U_(0x1) << PCC_WPMR_WPEN_Pos)
#define PCC_WPSR_WPVS_Msk (_U_(0x1) << PCC_WPSR_WPVS_Pos)
#define PCC_MR_Msk PCC_MR_MASK
#define PCC_IER_Msk PCC_IER_MASK
#define PCC_IDR_Msk PCC_IDR_MASK
#define PCC_IMR_Msk PCC_IMR_MASK
#define PCC_ISR_Msk PCC_ISR_MASK
#define PCC_RHR_Msk PCC_RHR_MASK
#define PCC_WPMR_Msk PCC_WPMR_MASK
#define PCC_WPSR_Msk PCC_WPSR_MASK
#define PICOP_CONFIG_ASP_Msk (_U_(0x1) << PICOP_CONFIG_ASP_Pos)
#define PICOP_CONFIG_MARRET_Msk (_U_(0x1) << PICOP_CONFIG_MARRET_Pos)
#define PICOP_CONFIG_PCEXEN_Msk (_U_(0x1) << PICOP_CONFIG_PCEXEN_Pos)
#define PICOP_CTRL_MAPUEXCEPT_Msk (_U_(0x1) << PICOP_CTRL_MAPUEXCEPT_Pos)
#define PICOP_CTRL_WPICACHE_Msk (_U_(0x1) << PICOP_CTRL_WPICACHE_Pos)
#define PICOP_CMD_STATUS_CTTSEX_Msk (_U_(0x1) << PICOP_CMD_STATUS_CTTSEX_Pos)
#define PICOP_CMD_STATUS_IL0EX_Msk (_U_(0x1) << PICOP_CMD_STATUS_IL0EX_Pos)
#define PICOP_CMD_STATUS_IL1EX_Msk (_U_(0x1) << PICOP_CMD_STATUS_IL1EX_Pos)
#define PICOP_CMD_STATUS_IL2EX_Msk (_U_(0x1) << PICOP_CMD_STATUS_IL2EX_Pos)
#define PICOP_CMD_STATUS_IL3EX_Msk (_U_(0x1) << PICOP_CMD_STATUS_IL3EX_Pos)
#define PICOP_CMD_STATUS_IL4EX_Msk (_U_(0x1) << PICOP_CMD_STATUS_IL4EX_Pos)
#define PICOP_CMD_STATUS_NMIEX_Msk (_U_(0x1) << PICOP_CMD_STATUS_NMIEX_Pos)
#define PICOP_CMD_STATUS_EXCEPT_Msk (_U_(0x1) << PICOP_CMD_STATUS_EXCEPT_Pos)
#define PICOP_CMD_STATUS_AVR16_Msk (_U_(0x1) << PICOP_CMD_STATUS_AVR16_Pos)
#define PICOP_CMD_STATUS_OCDCOF_Msk (_U_(0x1) << PICOP_CMD_STATUS_OCDCOF_Pos)
#define PICOP_OCDCONFIG_CCNTEN_Msk (_U_(0x1) << PICOP_OCDCONFIG_CCNTEN_Pos)
#define PICOP_OCDCONTROL_OCDEN_Msk (_U_(0x1) << PICOP_OCDCONTROL_OCDEN_Pos)
#define PICOP_OCDCONTROL_BPSSTEP_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPSSTEP_Pos)
#define PICOP_OCDCONTROL_BPCOF_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPCOF_Pos)
#define PICOP_OCDCONTROL_BPRST_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPRST_Pos)
#define PICOP_OCDCONTROL_BPEXCEPTION_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPEXCEPTION_Pos)
#define PICOP_OCDCONTROL_BPIRQ_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPIRQ_Pos)
#define PICOP_OCDCONTROL_BPSW_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPSW_Pos)
#define PICOP_OCDCONTROL_BPSLEEP_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPSLEEP_Pos)
#define PICOP_OCDCONTROL_BPWDT_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPWDT_Pos)
#define PICOP_OCDCONTROL_BPISA_Msk (_U_(0x1) << PICOP_OCDCONTROL_BPISA_Pos)
#define PICOP_OCDSTATUS_STATUS_BPEXT_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPEXT_Pos)
#define PICOP_OCDSTATUS_STATUS_BPSSTEP_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPSSTEP_Pos)
#define PICOP_OCDSTATUS_STATUS_BPCOF_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPCOF_Pos)
#define PICOP_OCDSTATUS_STATUS_BPRST_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPRST_Pos)
#define PICOP_OCDSTATUS_STATUS_BPEXCEPTION_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPEXCEPTION_Pos)
#define PICOP_OCDSTATUS_STATUS_BPIRQ_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPIRQ_Pos)
#define PICOP_OCDSTATUS_STATUS_BPSW_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPSW_Pos)
#define PICOP_OCDSTATUS_STATUS_BPSLEEP_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPSLEEP_Pos)
#define PICOP_OCDSTATUS_STATUS_BPWDT_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPWDT_Pos)
#define PICOP_OCDSTATUS_STATUS_BPISA_Msk (_U_(0x1) << PICOP_OCDSTATUS_STATUS_BPISA_Pos)
#define PICOP_MMUCTRL_IODIS_Msk (_U_(0x1) << PICOP_MMUCTRL_IODIS_Pos)
#define PICOP_MMUCTRL_MEMDIS_Msk (_U_(0x1) << PICOP_MMUCTRL_MEMDIS_Pos)
#define PICOP_ID_Msk PICOP_ID_MASK
#define PICOP_CONFIG_Msk PICOP_CONFIG_MASK
#define PICOP_CTRL_Msk PICOP_CTRL_MASK
#define PICOP_CMD_CMD_Msk PICOP_CMD_CMD_MASK
#define PICOP_CMD_STATUS_Msk PICOP_CMD_STATUS_MASK
#define PICOP_PC_Msk PICOP_PC_MASK
#define PICOP_HF_Msk PICOP_HF_MASK
#define PICOP_HFCTRL_Msk PICOP_HFCTRL_MASK
#define PICOP_HFSETCLR0_Msk PICOP_HFSETCLR0_MASK
#define PICOP_HFSETCLR1_Msk PICOP_HFSETCLR1_MASK
#define PICOP_OCDCONFIG_Msk PICOP_OCDCONFIG_MASK
#define PICOP_OCDCONTROL_Msk PICOP_OCDCONTROL_MASK
#define PICOP_OCDSTATUS_CMD_Msk PICOP_OCDSTATUS_CMD_MASK
#define PICOP_OCDSTATUS_STATUS_Msk PICOP_OCDSTATUS_STATUS_MASK
#define PICOP_OCDPC_Msk PICOP_OCDPC_MASK
#define PICOP_OCDFEAT_Msk PICOP_OCDFEAT_MASK
#define PICOP_OCDCCNT_Msk PICOP_OCDCCNT_MASK
#define PICOP_OCDBPGEN_Msk PICOP_OCDBPGEN_MASK
#define PICOP_R3R0_Msk PICOP_R3R0_MASK
#define PICOP_R7R4_Msk PICOP_R7R4_MASK
#define PICOP_R11R8_Msk PICOP_R11R8_MASK
#define PICOP_R15R12_Msk PICOP_R15R12_MASK
#define PICOP_R19R16_Msk PICOP_R19R16_MASK
#define PICOP_R23R20_Msk PICOP_R23R20_MASK
#define PICOP_R27R24_Msk PICOP_R27R24_MASK
#define PICOP_R31R28_Msk PICOP_R31R28_MASK
#define PICOP_S1S0_Msk PICOP_S1S0_MASK
#define PICOP_S3S2_Msk PICOP_S3S2_MASK
#define PICOP_S5S4_Msk PICOP_S5S4_MASK
#define PICOP_S11S10_Msk PICOP_S11S10_MASK
#define PICOP_LINK_Msk PICOP_LINK_MASK
#define PICOP_SP_Msk PICOP_SP_MASK
#define PICOP_MMUFLASH_Msk PICOP_MMUFLASH_MASK
#define PICOP_MMU0_Msk PICOP_MMU0_MASK
#define PICOP_MMU1_Msk PICOP_MMU1_MASK
#define PICOP_MMUCTRL_Msk PICOP_MMUCTRL_MASK
#define PICOP_ICACHE_Msk PICOP_ICACHE_MASK
#define PICOP_ICACHELRU_Msk PICOP_ICACHELRU_MASK
#define PICOP_QOSCTRL_Msk PICOP_QOSCTRL_MASK
#define PORT_WRCONFIG_PMUXEN_Msk (_U_(0x1) << PORT_WRCONFIG_PMUXEN_Pos)
#define PORT_WRCONFIG_INEN_Msk (_U_(0x1) << PORT_WRCONFIG_INEN_Pos)
#define PORT_WRCONFIG_PULLEN_Msk (_U_(0x1) << PORT_WRCONFIG_PULLEN_Pos)
#define PORT_WRCONFIG_DRVSTR_Msk (_U_(0x1) << PORT_WRCONFIG_DRVSTR_Pos)
#define PORT_WRCONFIG_WRPMUX_Msk (_U_(0x1) << PORT_WRCONFIG_WRPMUX_Pos)
#define PORT_WRCONFIG_WRPINCFG_Msk (_U_(0x1) << PORT_WRCONFIG_WRPINCFG_Pos)
#define PORT_WRCONFIG_HWSEL_Msk (_U_(0x1) << PORT_WRCONFIG_HWSEL_Pos)
#define PORT_EVCTRL_PORTEI0_Msk (_U_(0x1) << PORT_EVCTRL_PORTEI0_Pos)
#define PORT_EVCTRL_PORTEI1_Msk (_U_(0x1) << PORT_EVCTRL_PORTEI1_Pos)
#define PORT_EVCTRL_PORTEI2_Msk (_U_(0x1) << PORT_EVCTRL_PORTEI2_Pos)
#define PORT_EVCTRL_PORTEI3_Msk (_U_(0x1) << PORT_EVCTRL_PORTEI3_Pos)
#define PORT_PINCFG_PMUXEN_Msk (_U_(0x1) << PORT_PINCFG_PMUXEN_Pos)
#define PORT_PINCFG_INEN_Msk (_U_(0x1) << PORT_PINCFG_INEN_Pos)
#define PORT_PINCFG_PULLEN_Msk (_U_(0x1) << PORT_PINCFG_PULLEN_Pos)
#define PORT_PINCFG_DRVSTR_Msk (_U_(0x1) << PORT_PINCFG_DRVSTR_Pos)
#define PORT_DIR_Msk PORT_DIR_MASK
#define PORT_DIRCLR_Msk PORT_DIRCLR_MASK
#define PORT_DIRSET_Msk PORT_DIRSET_MASK
#define PORT_DIRTGL_Msk PORT_DIRTGL_MASK
#define PORT_OUT_Msk PORT_OUT_MASK
#define PORT_OUTCLR_Msk PORT_OUTCLR_MASK
#define PORT_OUTSET_Msk PORT_OUTSET_MASK
#define PORT_OUTTGL_Msk PORT_OUTTGL_MASK
#define PORT_IN_Msk PORT_IN_MASK
#define PORT_CTRL_Msk PORT_CTRL_MASK
#define PORT_WRCONFIG_Msk PORT_WRCONFIG_MASK
#define PORT_EVCTRL_Msk PORT_EVCTRL_MASK
#define PORT_PMUX_Msk PORT_PMUX_MASK
#define PORT_PINCFG_Msk PORT_PINCFG_MASK
#define RSTC_RCAUSE_POR_Msk (_U_(0x1) << RSTC_RCAUSE_POR_Pos)
#define RSTC_RCAUSE_BODCORE_Msk (_U_(0x1) << RSTC_RCAUSE_BODCORE_Pos)
#define RSTC_RCAUSE_BODVDD_Msk (_U_(0x1) << RSTC_RCAUSE_BODVDD_Pos)
#define RSTC_RCAUSE_NVM_Msk (_U_(0x1) << RSTC_RCAUSE_NVM_Pos)
#define RSTC_RCAUSE_EXT_Msk (_U_(0x1) << RSTC_RCAUSE_EXT_Pos)
#define RSTC_RCAUSE_WDT_Msk (_U_(0x1) << RSTC_RCAUSE_WDT_Pos)
#define RSTC_RCAUSE_SYST_Msk (_U_(0x1) << RSTC_RCAUSE_SYST_Pos)
#define RSTC_RCAUSE_BACKUP_Msk (_U_(0x1) << RSTC_RCAUSE_BACKUP_Pos)
#define RSTC_BKUPEXIT_RTC_Msk (_U_(0x1) << RSTC_BKUPEXIT_RTC_Pos)
#define RSTC_BKUPEXIT_BBPS_Msk (_U_(0x1) << RSTC_BKUPEXIT_BBPS_Pos)
#define RSTC_BKUPEXIT_HIB_Msk (_U_(0x1) << RSTC_BKUPEXIT_HIB_Pos)
#define RSTC_RCAUSE_Msk RSTC_RCAUSE_MASK
#define RSTC_BKUPEXIT_Msk RSTC_BKUPEXIT_MASK
#define SDHC_TMR_DMAEN_Msk (_U_(0x1) << SDHC_TMR_DMAEN_Pos)
#define SDHC_TMR_BCEN_Msk (_U_(0x1) << SDHC_TMR_BCEN_Pos)
#define SDHC_TMR_DTDSEL_Msk (_U_(0x1) << SDHC_TMR_DTDSEL_Pos)
#define SDHC_TMR_MSBSEL_Msk (_U_(0x1) << SDHC_TMR_MSBSEL_Pos)
#define SDHC_CR_CMDCCEN_Msk (_U_(0x1) << SDHC_CR_CMDCCEN_Pos)
#define SDHC_CR_CMDICEN_Msk (_U_(0x1) << SDHC_CR_CMDICEN_Pos)
#define SDHC_CR_DPSEL_Msk (_U_(0x1) << SDHC_CR_DPSEL_Pos)
#define SDHC_PSR_CMDINHC_Msk (_U_(0x1) << SDHC_PSR_CMDINHC_Pos)
#define SDHC_PSR_CMDINHD_Msk (_U_(0x1) << SDHC_PSR_CMDINHD_Pos)
#define SDHC_PSR_DLACT_Msk (_U_(0x1) << SDHC_PSR_DLACT_Pos)
#define SDHC_PSR_RTREQ_Msk (_U_(0x1) << SDHC_PSR_RTREQ_Pos)
#define SDHC_PSR_WTACT_Msk (_U_(0x1) << SDHC_PSR_WTACT_Pos)
#define SDHC_PSR_RTACT_Msk (_U_(0x1) << SDHC_PSR_RTACT_Pos)
#define SDHC_PSR_BUFWREN_Msk (_U_(0x1) << SDHC_PSR_BUFWREN_Pos)
#define SDHC_PSR_BUFRDEN_Msk (_U_(0x1) << SDHC_PSR_BUFRDEN_Pos)
#define SDHC_PSR_CARDINS_Msk (_U_(0x1) << SDHC_PSR_CARDINS_Pos)
#define SDHC_PSR_CARDSS_Msk (_U_(0x1) << SDHC_PSR_CARDSS_Pos)
#define SDHC_PSR_CARDDPL_Msk (_U_(0x1) << SDHC_PSR_CARDDPL_Pos)
#define SDHC_PSR_WRPPL_Msk (_U_(0x1) << SDHC_PSR_WRPPL_Pos)
#define SDHC_PSR_CMDLL_Msk (_U_(0x1) << SDHC_PSR_CMDLL_Pos)
#define SDHC_HC1R_LEDCTRL_Msk (_U_(0x1) << SDHC_HC1R_LEDCTRL_Pos)
#define SDHC_HC1R_DW_Msk (_U_(0x1) << SDHC_HC1R_DW_Pos)
#define SDHC_HC1R_HSEN_Msk (_U_(0x1) << SDHC_HC1R_HSEN_Pos)
#define SDHC_HC1R_CARDDTL_Msk (_U_(0x1) << SDHC_HC1R_CARDDTL_Pos)
#define SDHC_HC1R_CARDDSEL_Msk (_U_(0x1) << SDHC_HC1R_CARDDSEL_Pos)
#define SDHC_HC1R_EMMC_DW_Msk (_U_(0x1) << SDHC_HC1R_EMMC_DW_Pos)
#define SDHC_HC1R_EMMC_HSEN_Msk (_U_(0x1) << SDHC_HC1R_EMMC_HSEN_Pos)
#define SDHC_PCR_SDBPWR_Msk (_U_(0x1) << SDHC_PCR_SDBPWR_Pos)
#define SDHC_BGCR_STPBGR_Msk (_U_(0x1) << SDHC_BGCR_STPBGR_Pos)
#define SDHC_BGCR_CONTR_Msk (_U_(0x1) << SDHC_BGCR_CONTR_Pos)
#define SDHC_BGCR_RWCTRL_Msk (_U_(0x1) << SDHC_BGCR_RWCTRL_Pos)
#define SDHC_BGCR_INTBG_Msk (_U_(0x1) << SDHC_BGCR_INTBG_Pos)
#define SDHC_BGCR_EMMC_STPBGR_Msk (_U_(0x1) << SDHC_BGCR_EMMC_STPBGR_Pos)
#define SDHC_BGCR_EMMC_CONTR_Msk (_U_(0x1) << SDHC_BGCR_EMMC_CONTR_Pos)
#define SDHC_WCR_WKENCINT_Msk (_U_(0x1) << SDHC_WCR_WKENCINT_Pos)
#define SDHC_WCR_WKENCINS_Msk (_U_(0x1) << SDHC_WCR_WKENCINS_Pos)
#define SDHC_WCR_WKENCREM_Msk (_U_(0x1) << SDHC_WCR_WKENCREM_Pos)
#define SDHC_CCR_INTCLKEN_Msk (_U_(0x1) << SDHC_CCR_INTCLKEN_Pos)
#define SDHC_CCR_INTCLKS_Msk (_U_(0x1) << SDHC_CCR_INTCLKS_Pos)
#define SDHC_CCR_SDCLKEN_Msk (_U_(0x1) << SDHC_CCR_SDCLKEN_Pos)
#define SDHC_CCR_CLKGSEL_Msk (_U_(0x1) << SDHC_CCR_CLKGSEL_Pos)
#define SDHC_SRR_SWRSTALL_Msk (_U_(0x1) << SDHC_SRR_SWRSTALL_Pos)
#define SDHC_SRR_SWRSTCMD_Msk (_U_(0x1) << SDHC_SRR_SWRSTCMD_Pos)
#define SDHC_SRR_SWRSTDAT_Msk (_U_(0x1) << SDHC_SRR_SWRSTDAT_Pos)
#define SDHC_NISTR_CMDC_Msk (_U_(0x1) << SDHC_NISTR_CMDC_Pos)
#define SDHC_NISTR_TRFC_Msk (_U_(0x1) << SDHC_NISTR_TRFC_Pos)
#define SDHC_NISTR_BLKGE_Msk (_U_(0x1) << SDHC_NISTR_BLKGE_Pos)
#define SDHC_NISTR_DMAINT_Msk (_U_(0x1) << SDHC_NISTR_DMAINT_Pos)
#define SDHC_NISTR_BWRRDY_Msk (_U_(0x1) << SDHC_NISTR_BWRRDY_Pos)
#define SDHC_NISTR_BRDRDY_Msk (_U_(0x1) << SDHC_NISTR_BRDRDY_Pos)
#define SDHC_NISTR_CINS_Msk (_U_(0x1) << SDHC_NISTR_CINS_Pos)
#define SDHC_NISTR_CREM_Msk (_U_(0x1) << SDHC_NISTR_CREM_Pos)
#define SDHC_NISTR_CINT_Msk (_U_(0x1) << SDHC_NISTR_CINT_Pos)
#define SDHC_NISTR_ERRINT_Msk (_U_(0x1) << SDHC_NISTR_ERRINT_Pos)
#define SDHC_NISTR_EMMC_CMDC_Msk (_U_(0x1) << SDHC_NISTR_EMMC_CMDC_Pos)
#define SDHC_NISTR_EMMC_TRFC_Msk (_U_(0x1) << SDHC_NISTR_EMMC_TRFC_Pos)
#define SDHC_NISTR_EMMC_BLKGE_Msk (_U_(0x1) << SDHC_NISTR_EMMC_BLKGE_Pos)
#define SDHC_NISTR_EMMC_DMAINT_Msk (_U_(0x1) << SDHC_NISTR_EMMC_DMAINT_Pos)
#define SDHC_NISTR_EMMC_BWRRDY_Msk (_U_(0x1) << SDHC_NISTR_EMMC_BWRRDY_Pos)
#define SDHC_NISTR_EMMC_BRDRDY_Msk (_U_(0x1) << SDHC_NISTR_EMMC_BRDRDY_Pos)
#define SDHC_NISTR_EMMC_BOOTAR_Msk (_U_(0x1) << SDHC_NISTR_EMMC_BOOTAR_Pos)
#define SDHC_NISTR_EMMC_ERRINT_Msk (_U_(0x1) << SDHC_NISTR_EMMC_ERRINT_Pos)
#define SDHC_EISTR_CMDTEO_Msk (_U_(0x1) << SDHC_EISTR_CMDTEO_Pos)
#define SDHC_EISTR_CMDCRC_Msk (_U_(0x1) << SDHC_EISTR_CMDCRC_Pos)
#define SDHC_EISTR_CMDEND_Msk (_U_(0x1) << SDHC_EISTR_CMDEND_Pos)
#define SDHC_EISTR_CMDIDX_Msk (_U_(0x1) << SDHC_EISTR_CMDIDX_Pos)
#define SDHC_EISTR_DATTEO_Msk (_U_(0x1) << SDHC_EISTR_DATTEO_Pos)
#define SDHC_EISTR_DATCRC_Msk (_U_(0x1) << SDHC_EISTR_DATCRC_Pos)
#define SDHC_EISTR_DATEND_Msk (_U_(0x1) << SDHC_EISTR_DATEND_Pos)
#define SDHC_EISTR_CURLIM_Msk (_U_(0x1) << SDHC_EISTR_CURLIM_Pos)
#define SDHC_EISTR_ACMD_Msk (_U_(0x1) << SDHC_EISTR_ACMD_Pos)
#define SDHC_EISTR_ADMA_Msk (_U_(0x1) << SDHC_EISTR_ADMA_Pos)
#define SDHC_EISTR_EMMC_CMDTEO_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CMDTEO_Pos)
#define SDHC_EISTR_EMMC_CMDCRC_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CMDCRC_Pos)
#define SDHC_EISTR_EMMC_CMDEND_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CMDEND_Pos)
#define SDHC_EISTR_EMMC_CMDIDX_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CMDIDX_Pos)
#define SDHC_EISTR_EMMC_DATTEO_Msk (_U_(0x1) << SDHC_EISTR_EMMC_DATTEO_Pos)
#define SDHC_EISTR_EMMC_DATCRC_Msk (_U_(0x1) << SDHC_EISTR_EMMC_DATCRC_Pos)
#define SDHC_EISTR_EMMC_DATEND_Msk (_U_(0x1) << SDHC_EISTR_EMMC_DATEND_Pos)
#define SDHC_EISTR_EMMC_CURLIM_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CURLIM_Pos)
#define SDHC_EISTR_EMMC_ACMD_Msk (_U_(0x1) << SDHC_EISTR_EMMC_ACMD_Pos)
#define SDHC_EISTR_EMMC_ADMA_Msk (_U_(0x1) << SDHC_EISTR_EMMC_ADMA_Pos)
#define SDHC_EISTR_EMMC_BOOTAE_Msk (_U_(0x1) << SDHC_EISTR_EMMC_BOOTAE_Pos)
#define SDHC_NISTER_CMDC_Msk (_U_(0x1) << SDHC_NISTER_CMDC_Pos)
#define SDHC_NISTER_TRFC_Msk (_U_(0x1) << SDHC_NISTER_TRFC_Pos)
#define SDHC_NISTER_BLKGE_Msk (_U_(0x1) << SDHC_NISTER_BLKGE_Pos)
#define SDHC_NISTER_DMAINT_Msk (_U_(0x1) << SDHC_NISTER_DMAINT_Pos)
#define SDHC_NISTER_BWRRDY_Msk (_U_(0x1) << SDHC_NISTER_BWRRDY_Pos)
#define SDHC_NISTER_BRDRDY_Msk (_U_(0x1) << SDHC_NISTER_BRDRDY_Pos)
#define SDHC_NISTER_CINS_Msk (_U_(0x1) << SDHC_NISTER_CINS_Pos)
#define SDHC_NISTER_CREM_Msk (_U_(0x1) << SDHC_NISTER_CREM_Pos)
#define SDHC_NISTER_CINT_Msk (_U_(0x1) << SDHC_NISTER_CINT_Pos)
#define SDHC_NISTER_EMMC_CMDC_Msk (_U_(0x1) << SDHC_NISTER_EMMC_CMDC_Pos)
#define SDHC_NISTER_EMMC_TRFC_Msk (_U_(0x1) << SDHC_NISTER_EMMC_TRFC_Pos)
#define SDHC_NISTER_EMMC_BLKGE_Msk (_U_(0x1) << SDHC_NISTER_EMMC_BLKGE_Pos)
#define SDHC_NISTER_EMMC_DMAINT_Msk (_U_(0x1) << SDHC_NISTER_EMMC_DMAINT_Pos)
#define SDHC_NISTER_EMMC_BWRRDY_Msk (_U_(0x1) << SDHC_NISTER_EMMC_BWRRDY_Pos)
#define SDHC_NISTER_EMMC_BRDRDY_Msk (_U_(0x1) << SDHC_NISTER_EMMC_BRDRDY_Pos)
#define SDHC_NISTER_EMMC_BOOTAR_Msk (_U_(0x1) << SDHC_NISTER_EMMC_BOOTAR_Pos)
#define SDHC_EISTER_CMDTEO_Msk (_U_(0x1) << SDHC_EISTER_CMDTEO_Pos)
#define SDHC_EISTER_CMDCRC_Msk (_U_(0x1) << SDHC_EISTER_CMDCRC_Pos)
#define SDHC_EISTER_CMDEND_Msk (_U_(0x1) << SDHC_EISTER_CMDEND_Pos)
#define SDHC_EISTER_CMDIDX_Msk (_U_(0x1) << SDHC_EISTER_CMDIDX_Pos)
#define SDHC_EISTER_DATTEO_Msk (_U_(0x1) << SDHC_EISTER_DATTEO_Pos)
#define SDHC_EISTER_DATCRC_Msk (_U_(0x1) << SDHC_EISTER_DATCRC_Pos)
#define SDHC_EISTER_DATEND_Msk (_U_(0x1) << SDHC_EISTER_DATEND_Pos)
#define SDHC_EISTER_CURLIM_Msk (_U_(0x1) << SDHC_EISTER_CURLIM_Pos)
#define SDHC_EISTER_ACMD_Msk (_U_(0x1) << SDHC_EISTER_ACMD_Pos)
#define SDHC_EISTER_ADMA_Msk (_U_(0x1) << SDHC_EISTER_ADMA_Pos)
#define SDHC_EISTER_EMMC_CMDTEO_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CMDTEO_Pos)
#define SDHC_EISTER_EMMC_CMDCRC_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CMDCRC_Pos)
#define SDHC_EISTER_EMMC_CMDEND_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CMDEND_Pos)
#define SDHC_EISTER_EMMC_CMDIDX_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CMDIDX_Pos)
#define SDHC_EISTER_EMMC_DATTEO_Msk (_U_(0x1) << SDHC_EISTER_EMMC_DATTEO_Pos)
#define SDHC_EISTER_EMMC_DATCRC_Msk (_U_(0x1) << SDHC_EISTER_EMMC_DATCRC_Pos)
#define SDHC_EISTER_EMMC_DATEND_Msk (_U_(0x1) << SDHC_EISTER_EMMC_DATEND_Pos)
#define SDHC_EISTER_EMMC_CURLIM_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CURLIM_Pos)
#define SDHC_EISTER_EMMC_ACMD_Msk (_U_(0x1) << SDHC_EISTER_EMMC_ACMD_Pos)
#define SDHC_EISTER_EMMC_ADMA_Msk (_U_(0x1) << SDHC_EISTER_EMMC_ADMA_Pos)
#define SDHC_EISTER_EMMC_BOOTAE_Msk (_U_(0x1) << SDHC_EISTER_EMMC_BOOTAE_Pos)
#define SDHC_NISIER_CMDC_Msk (_U_(0x1) << SDHC_NISIER_CMDC_Pos)
#define SDHC_NISIER_TRFC_Msk (_U_(0x1) << SDHC_NISIER_TRFC_Pos)
#define SDHC_NISIER_BLKGE_Msk (_U_(0x1) << SDHC_NISIER_BLKGE_Pos)
#define SDHC_NISIER_DMAINT_Msk (_U_(0x1) << SDHC_NISIER_DMAINT_Pos)
#define SDHC_NISIER_BWRRDY_Msk (_U_(0x1) << SDHC_NISIER_BWRRDY_Pos)
#define SDHC_NISIER_BRDRDY_Msk (_U_(0x1) << SDHC_NISIER_BRDRDY_Pos)
#define SDHC_NISIER_CINS_Msk (_U_(0x1) << SDHC_NISIER_CINS_Pos)
#define SDHC_NISIER_CREM_Msk (_U_(0x1) << SDHC_NISIER_CREM_Pos)
#define SDHC_NISIER_CINT_Msk (_U_(0x1) << SDHC_NISIER_CINT_Pos)
#define SDHC_NISIER_EMMC_CMDC_Msk (_U_(0x1) << SDHC_NISIER_EMMC_CMDC_Pos)
