dylad/RIOT/cpu/sam0_common/include/vendor/same54/include/compat_same54.h
#define SDHC_NISIER_EMMC_TRFC_Msk (_U_(0x1) << SDHC_NISIER_EMMC_TRFC_Pos)
#define SDHC_NISIER_EMMC_BLKGE_Msk (_U_(0x1) << SDHC_NISIER_EMMC_BLKGE_Pos)
#define SDHC_NISIER_EMMC_DMAINT_Msk (_U_(0x1) << SDHC_NISIER_EMMC_DMAINT_Pos)
#define SDHC_NISIER_EMMC_BWRRDY_Msk (_U_(0x1) << SDHC_NISIER_EMMC_BWRRDY_Pos)
#define SDHC_NISIER_EMMC_BRDRDY_Msk (_U_(0x1) << SDHC_NISIER_EMMC_BRDRDY_Pos)
#define SDHC_NISIER_EMMC_BOOTAR_Msk (_U_(0x1) << SDHC_NISIER_EMMC_BOOTAR_Pos)
#define SDHC_EISIER_CMDTEO_Msk (_U_(0x1) << SDHC_EISIER_CMDTEO_Pos)
#define SDHC_EISIER_CMDCRC_Msk (_U_(0x1) << SDHC_EISIER_CMDCRC_Pos)
#define SDHC_EISIER_CMDEND_Msk (_U_(0x1) << SDHC_EISIER_CMDEND_Pos)
#define SDHC_EISIER_CMDIDX_Msk (_U_(0x1) << SDHC_EISIER_CMDIDX_Pos)
#define SDHC_EISIER_DATTEO_Msk (_U_(0x1) << SDHC_EISIER_DATTEO_Pos)
#define SDHC_EISIER_DATCRC_Msk (_U_(0x1) << SDHC_EISIER_DATCRC_Pos)
#define SDHC_EISIER_DATEND_Msk (_U_(0x1) << SDHC_EISIER_DATEND_Pos)
#define SDHC_EISIER_CURLIM_Msk (_U_(0x1) << SDHC_EISIER_CURLIM_Pos)
#define SDHC_EISIER_ACMD_Msk (_U_(0x1) << SDHC_EISIER_ACMD_Pos)
#define SDHC_EISIER_ADMA_Msk (_U_(0x1) << SDHC_EISIER_ADMA_Pos)
#define SDHC_EISIER_EMMC_CMDTEO_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CMDTEO_Pos)
#define SDHC_EISIER_EMMC_CMDCRC_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CMDCRC_Pos)
#define SDHC_EISIER_EMMC_CMDEND_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CMDEND_Pos)
#define SDHC_EISIER_EMMC_CMDIDX_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CMDIDX_Pos)
#define SDHC_EISIER_EMMC_DATTEO_Msk (_U_(0x1) << SDHC_EISIER_EMMC_DATTEO_Pos)
#define SDHC_EISIER_EMMC_DATCRC_Msk (_U_(0x1) << SDHC_EISIER_EMMC_DATCRC_Pos)
#define SDHC_EISIER_EMMC_DATEND_Msk (_U_(0x1) << SDHC_EISIER_EMMC_DATEND_Pos)
#define SDHC_EISIER_EMMC_CURLIM_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CURLIM_Pos)
#define SDHC_EISIER_EMMC_ACMD_Msk (_U_(0x1) << SDHC_EISIER_EMMC_ACMD_Pos)
#define SDHC_EISIER_EMMC_ADMA_Msk (_U_(0x1) << SDHC_EISIER_EMMC_ADMA_Pos)
#define SDHC_EISIER_EMMC_BOOTAE_Msk (_U_(0x1) << SDHC_EISIER_EMMC_BOOTAE_Pos)
#define SDHC_ACESR_ACMD12NE_Msk (_U_(0x1) << SDHC_ACESR_ACMD12NE_Pos)
#define SDHC_ACESR_ACMDTEO_Msk (_U_(0x1) << SDHC_ACESR_ACMDTEO_Pos)
#define SDHC_ACESR_ACMDCRC_Msk (_U_(0x1) << SDHC_ACESR_ACMDCRC_Pos)
#define SDHC_ACESR_ACMDEND_Msk (_U_(0x1) << SDHC_ACESR_ACMDEND_Pos)
#define SDHC_ACESR_ACMDIDX_Msk (_U_(0x1) << SDHC_ACESR_ACMDIDX_Pos)
#define SDHC_ACESR_CMDNI_Msk (_U_(0x1) << SDHC_ACESR_CMDNI_Pos)
#define SDHC_HC2R_VS18EN_Msk (_U_(0x1) << SDHC_HC2R_VS18EN_Pos)
#define SDHC_HC2R_EXTUN_Msk (_U_(0x1) << SDHC_HC2R_EXTUN_Pos)
#define SDHC_HC2R_SLCKSEL_Msk (_U_(0x1) << SDHC_HC2R_SLCKSEL_Pos)
#define SDHC_HC2R_ASINTEN_Msk (_U_(0x1) << SDHC_HC2R_ASINTEN_Pos)
#define SDHC_HC2R_PVALEN_Msk (_U_(0x1) << SDHC_HC2R_PVALEN_Pos)
#define SDHC_HC2R_EMMC_EXTUN_Msk (_U_(0x1) << SDHC_HC2R_EMMC_EXTUN_Pos)
#define SDHC_HC2R_EMMC_SLCKSEL_Msk (_U_(0x1) << SDHC_HC2R_EMMC_SLCKSEL_Pos)
#define SDHC_HC2R_EMMC_PVALEN_Msk (_U_(0x1) << SDHC_HC2R_EMMC_PVALEN_Pos)
#define SDHC_CA0R_TEOCLKU_Msk (_U_(0x1) << SDHC_CA0R_TEOCLKU_Pos)
#define SDHC_CA0R_ED8SUP_Msk (_U_(0x1) << SDHC_CA0R_ED8SUP_Pos)
#define SDHC_CA0R_ADMA2SUP_Msk (_U_(0x1) << SDHC_CA0R_ADMA2SUP_Pos)
#define SDHC_CA0R_HSSUP_Msk (_U_(0x1) << SDHC_CA0R_HSSUP_Pos)
#define SDHC_CA0R_SDMASUP_Msk (_U_(0x1) << SDHC_CA0R_SDMASUP_Pos)
#define SDHC_CA0R_SRSUP_Msk (_U_(0x1) << SDHC_CA0R_SRSUP_Pos)
#define SDHC_CA0R_V33VSUP_Msk (_U_(0x1) << SDHC_CA0R_V33VSUP_Pos)
#define SDHC_CA0R_V30VSUP_Msk (_U_(0x1) << SDHC_CA0R_V30VSUP_Pos)
#define SDHC_CA0R_V18VSUP_Msk (_U_(0x1) << SDHC_CA0R_V18VSUP_Pos)
#define SDHC_CA0R_SB64SUP_Msk (_U_(0x1) << SDHC_CA0R_SB64SUP_Pos)
#define SDHC_CA0R_ASINTSUP_Msk (_U_(0x1) << SDHC_CA0R_ASINTSUP_Pos)
#define SDHC_CA1R_SDR50SUP_Msk (_U_(0x1) << SDHC_CA1R_SDR50SUP_Pos)
#define SDHC_CA1R_SDR104SUP_Msk (_U_(0x1) << SDHC_CA1R_SDR104SUP_Pos)
#define SDHC_CA1R_DDR50SUP_Msk (_U_(0x1) << SDHC_CA1R_DDR50SUP_Pos)
#define SDHC_CA1R_DRVASUP_Msk (_U_(0x1) << SDHC_CA1R_DRVASUP_Pos)
#define SDHC_CA1R_DRVCSUP_Msk (_U_(0x1) << SDHC_CA1R_DRVCSUP_Pos)
#define SDHC_CA1R_DRVDSUP_Msk (_U_(0x1) << SDHC_CA1R_DRVDSUP_Pos)
#define SDHC_CA1R_TSDR50_Msk (_U_(0x1) << SDHC_CA1R_TSDR50_Pos)
#define SDHC_FERACES_ACMD12NE_Msk (_U_(0x1) << SDHC_FERACES_ACMD12NE_Pos)
#define SDHC_FERACES_ACMDTEO_Msk (_U_(0x1) << SDHC_FERACES_ACMDTEO_Pos)
#define SDHC_FERACES_ACMDCRC_Msk (_U_(0x1) << SDHC_FERACES_ACMDCRC_Pos)
#define SDHC_FERACES_ACMDEND_Msk (_U_(0x1) << SDHC_FERACES_ACMDEND_Pos)
#define SDHC_FERACES_ACMDIDX_Msk (_U_(0x1) << SDHC_FERACES_ACMDIDX_Pos)
#define SDHC_FERACES_CMDNI_Msk (_U_(0x1) << SDHC_FERACES_CMDNI_Pos)
#define SDHC_FEREIS_CMDTEO_Msk (_U_(0x1) << SDHC_FEREIS_CMDTEO_Pos)
#define SDHC_FEREIS_CMDCRC_Msk (_U_(0x1) << SDHC_FEREIS_CMDCRC_Pos)
#define SDHC_FEREIS_CMDEND_Msk (_U_(0x1) << SDHC_FEREIS_CMDEND_Pos)
#define SDHC_FEREIS_CMDIDX_Msk (_U_(0x1) << SDHC_FEREIS_CMDIDX_Pos)
#define SDHC_FEREIS_DATTEO_Msk (_U_(0x1) << SDHC_FEREIS_DATTEO_Pos)
#define SDHC_FEREIS_DATCRC_Msk (_U_(0x1) << SDHC_FEREIS_DATCRC_Pos)
#define SDHC_FEREIS_DATEND_Msk (_U_(0x1) << SDHC_FEREIS_DATEND_Pos)
#define SDHC_FEREIS_CURLIM_Msk (_U_(0x1) << SDHC_FEREIS_CURLIM_Pos)
#define SDHC_FEREIS_ACMD_Msk (_U_(0x1) << SDHC_FEREIS_ACMD_Pos)
#define SDHC_FEREIS_ADMA_Msk (_U_(0x1) << SDHC_FEREIS_ADMA_Pos)
#define SDHC_FEREIS_BOOTAE_Msk (_U_(0x1) << SDHC_FEREIS_BOOTAE_Pos)
#define SDHC_AESR_LMIS_Msk (_U_(0x1) << SDHC_AESR_LMIS_Pos)
#define SDHC_PVR_CLKGSEL_Msk (_U_(0x1) << SDHC_PVR_CLKGSEL_Pos)
#define SDHC_MC1R_DDR_Msk (_U_(0x1) << SDHC_MC1R_DDR_Pos)
#define SDHC_MC1R_OPD_Msk (_U_(0x1) << SDHC_MC1R_OPD_Pos)
#define SDHC_MC1R_BOOTA_Msk (_U_(0x1) << SDHC_MC1R_BOOTA_Pos)
#define SDHC_MC1R_RSTN_Msk (_U_(0x1) << SDHC_MC1R_RSTN_Pos)
#define SDHC_MC1R_FCD_Msk (_U_(0x1) << SDHC_MC1R_FCD_Pos)
#define SDHC_MC2R_SRESP_Msk (_U_(0x1) << SDHC_MC2R_SRESP_Pos)
#define SDHC_MC2R_ABOOT_Msk (_U_(0x1) << SDHC_MC2R_ABOOT_Pos)
#define SDHC_CC2R_FSDCLKD_Msk (_U_(0x1) << SDHC_CC2R_FSDCLKD_Pos)
#define SDHC_CACR_CAPWREN_Msk (_U_(0x1) << SDHC_CACR_CAPWREN_Pos)
#define SDHC_DBGR_NIDBG_Msk (_U_(0x1) << SDHC_DBGR_NIDBG_Pos)
#define SDHC_SSAR_CMD23_Msk SDHC_SSAR_CMD23_MASK
#define SDHC_SSAR_Msk SDHC_SSAR_MASK
#define SDHC_BSR_Msk SDHC_BSR_MASK
#define SDHC_BCR_Msk SDHC_BCR_MASK
#define SDHC_ARG1R_Msk SDHC_ARG1R_MASK
#define SDHC_TMR_Msk SDHC_TMR_MASK
#define SDHC_CR_Msk SDHC_CR_MASK
#define SDHC_RR_Msk SDHC_RR_MASK
#define SDHC_BDPR_Msk SDHC_BDPR_MASK
#define SDHC_PSR_Msk SDHC_PSR_MASK
#define SDHC_HC1R_Msk SDHC_HC1R_MASK
#define SDHC_HC1R_EMMC_Msk SDHC_HC1R_EMMC_MASK
#define SDHC_PCR_Msk SDHC_PCR_MASK
#define SDHC_BGCR_Msk SDHC_BGCR_MASK
#define SDHC_BGCR_EMMC_Msk SDHC_BGCR_EMMC_MASK
#define SDHC_WCR_Msk SDHC_WCR_MASK
#define SDHC_CCR_Msk SDHC_CCR_MASK
#define SDHC_TCR_Msk SDHC_TCR_MASK
#define SDHC_SRR_Msk SDHC_SRR_MASK
#define SDHC_NISTR_Msk SDHC_NISTR_MASK
#define SDHC_NISTR_EMMC_Msk SDHC_NISTR_EMMC_MASK
#define SDHC_EISTR_Msk SDHC_EISTR_MASK
#define SDHC_EISTR_EMMC_Msk SDHC_EISTR_EMMC_MASK
#define SDHC_NISTER_Msk SDHC_NISTER_MASK
#define SDHC_NISTER_EMMC_Msk SDHC_NISTER_EMMC_MASK
#define SDHC_EISTER_Msk SDHC_EISTER_MASK
#define SDHC_EISTER_EMMC_Msk SDHC_EISTER_EMMC_MASK
#define SDHC_NISIER_Msk SDHC_NISIER_MASK
#define SDHC_NISIER_EMMC_Msk SDHC_NISIER_EMMC_MASK
#define SDHC_EISIER_Msk SDHC_EISIER_MASK
#define SDHC_EISIER_EMMC_Msk SDHC_EISIER_EMMC_MASK
#define SDHC_ACESR_Msk SDHC_ACESR_MASK
#define SDHC_HC2R_Msk SDHC_HC2R_MASK
#define SDHC_HC2R_EMMC_Msk SDHC_HC2R_EMMC_MASK
#define SDHC_CA0R_Msk SDHC_CA0R_MASK
#define SDHC_CA1R_Msk SDHC_CA1R_MASK
#define SDHC_MCCAR_Msk SDHC_MCCAR_MASK
#define SDHC_FERACES_Msk SDHC_FERACES_MASK
#define SDHC_FEREIS_Msk SDHC_FEREIS_MASK
#define SDHC_AESR_Msk SDHC_AESR_MASK
#define SDHC_ASAR_Msk SDHC_ASAR_MASK
#define SDHC_PVR_Msk SDHC_PVR_MASK
#define SDHC_SISR_Msk SDHC_SISR_MASK
#define SDHC_HCVR_Msk SDHC_HCVR_MASK
#define SDHC_MC1R_Msk SDHC_MC1R_MASK
#define SDHC_MC2R_Msk SDHC_MC2R_MASK
#define SDHC_ACR_Msk SDHC_ACR_MASK
#define SDHC_CC2R_Msk SDHC_CC2R_MASK
#define SDHC_CACR_Msk SDHC_CACR_MASK
#define SDHC_DBGR_Msk SDHC_DBGR_MASK
#define AC_CTRLB_START0_Msk (_U_(0x1) << AC_CTRLB_START0_Pos)
#define AC_CTRLB_START1_Msk (_U_(0x1) << AC_CTRLB_START1_Pos)
#define AC_EVCTRL_COMPEO0_Msk (_U_(0x1) << AC_EVCTRL_COMPEO0_Pos)
#define AC_EVCTRL_COMPEO1_Msk (_U_(0x1) << AC_EVCTRL_COMPEO1_Pos)
#define AC_EVCTRL_WINEO0_Msk (_U_(0x1) << AC_EVCTRL_WINEO0_Pos)
#define AC_EVCTRL_COMPEI0_Msk (_U_(0x1) << AC_EVCTRL_COMPEI0_Pos)
#define AC_EVCTRL_COMPEI1_Msk (_U_(0x1) << AC_EVCTRL_COMPEI1_Pos)
#define AC_INTENCLR_COMP0_Msk (_U_(0x1) << AC_INTENCLR_COMP0_Pos)
#define AC_INTENCLR_COMP1_Msk (_U_(0x1) << AC_INTENCLR_COMP1_Pos)
#define AC_INTENCLR_WIN0_Msk (_U_(0x1) << AC_INTENCLR_WIN0_Pos)
#define AC_INTENSET_COMP0_Msk (_U_(0x1) << AC_INTENSET_COMP0_Pos)
#define AC_INTENSET_COMP1_Msk (_U_(0x1) << AC_INTENSET_COMP1_Pos)
#define AC_INTENSET_WIN0_Msk (_U_(0x1) << AC_INTENSET_WIN0_Pos)
#define AC_INTFLAG_COMP0_Msk (_U_(0x1) << AC_INTFLAG_COMP0_Pos)
#define AC_INTFLAG_COMP1_Msk (_U_(0x1) << AC_INTFLAG_COMP1_Pos)
#define AC_INTFLAG_WIN0_Msk (_U_(0x1) << AC_INTFLAG_WIN0_Pos)
#define AC_STATUSA_STATE0_Msk (_U_(0x1) << AC_STATUSA_STATE0_Pos)
#define AC_STATUSA_STATE1_Msk (_U_(0x1) << AC_STATUSA_STATE1_Pos)
#define AC_STATUSB_READY0_Msk (_U_(0x1) << AC_STATUSB_READY0_Pos)
#define AC_STATUSB_READY1_Msk (_U_(0x1) << AC_STATUSB_READY1_Pos)
#define AC_WINCTRL_WEN0_Msk (_U_(0x1) << AC_WINCTRL_WEN0_Pos)
#define AC_COMPCTRL_ENABLE_Msk (_U_(0x1) << AC_COMPCTRL_ENABLE_Pos)
#define AC_COMPCTRL_SINGLE_Msk (_U_(0x1) << AC_COMPCTRL_SINGLE_Pos)
#define AC_COMPCTRL_RUNSTDBY_Msk (_U_(0x1) << AC_COMPCTRL_RUNSTDBY_Pos)
#define AC_COMPCTRL_SWAP_Msk (_U_(0x1) << AC_COMPCTRL_SWAP_Pos)
#define AC_COMPCTRL_HYSTEN_Msk (_U_(0x1) << AC_COMPCTRL_HYSTEN_Pos)
#define AC_SYNCBUSY_WINCTRL_Msk (_U_(0x1) << AC_SYNCBUSY_WINCTRL_Pos)
#define AC_SYNCBUSY_COMPCTRL0_Msk (_U_(0x1) << AC_SYNCBUSY_COMPCTRL0_Pos)
#define AC_SYNCBUSY_COMPCTRL1_Msk (_U_(0x1) << AC_SYNCBUSY_COMPCTRL1_Pos)
#define AC_STATUSA_Msk AC_STATUSA_MASK
#define AC_STATUSB_Msk AC_STATUSB_MASK
#define AC_WINCTRL_Msk AC_WINCTRL_MASK
#define AC_SCALER_Msk AC_SCALER_MASK
#define AC_COMPCTRL_Msk AC_COMPCTRL_MASK
#define AC_CALIB_Msk AC_CALIB_MASK
#define ADC_CTRLA_SWRST_Msk (_U_(0x1) << ADC_CTRLA_SWRST_Pos)
#define ADC_CTRLA_ENABLE_Msk (_U_(0x1) << ADC_CTRLA_ENABLE_Pos)
#define ADC_CTRLA_SLAVEEN_Msk (_U_(0x1) << ADC_CTRLA_SLAVEEN_Pos)
#define ADC_CTRLA_RUNSTDBY_Msk (_U_(0x1) << ADC_CTRLA_RUNSTDBY_Pos)
#define ADC_CTRLA_ONDEMAND_Msk (_U_(0x1) << ADC_CTRLA_ONDEMAND_Pos)
#define ADC_CTRLA_R2R_Msk (_U_(0x1) << ADC_CTRLA_R2R_Pos)
#define ADC_EVCTRL_FLUSHEI_Msk (_U_(0x1) << ADC_EVCTRL_FLUSHEI_Pos)
#define ADC_EVCTRL_STARTEI_Msk (_U_(0x1) << ADC_EVCTRL_STARTEI_Pos)
#define ADC_EVCTRL_FLUSHINV_Msk (_U_(0x1) << ADC_EVCTRL_FLUSHINV_Pos)
#define ADC_EVCTRL_STARTINV_Msk (_U_(0x1) << ADC_EVCTRL_STARTINV_Pos)
#define ADC_EVCTRL_RESRDYEO_Msk (_U_(0x1) << ADC_EVCTRL_RESRDYEO_Pos)
#define ADC_EVCTRL_WINMONEO_Msk (_U_(0x1) << ADC_EVCTRL_WINMONEO_Pos)
#define ADC_DBGCTRL_DBGRUN_Msk (_U_(0x1) << ADC_DBGCTRL_DBGRUN_Pos)
#define ADC_INPUTCTRL_DIFFMODE_Msk (_U_(0x1) << ADC_INPUTCTRL_DIFFMODE_Pos)
#define ADC_INPUTCTRL_DSEQSTOP_Msk (_U_(0x1) << ADC_INPUTCTRL_DSEQSTOP_Pos)
#define ADC_CTRLB_LEFTADJ_Msk (_U_(0x1) << ADC_CTRLB_LEFTADJ_Pos)
#define ADC_CTRLB_FREERUN_Msk (_U_(0x1) << ADC_CTRLB_FREERUN_Pos)
#define ADC_CTRLB_CORREN_Msk (_U_(0x1) << ADC_CTRLB_CORREN_Pos)
#define ADC_CTRLB_WINSS_Msk (_U_(0x1) << ADC_CTRLB_WINSS_Pos)
#define ADC_REFCTRL_REFCOMP_Msk (_U_(0x1) << ADC_REFCTRL_REFCOMP_Pos)
#define ADC_SAMPCTRL_OFFCOMP_Msk (_U_(0x1) << ADC_SAMPCTRL_OFFCOMP_Pos)
#define ADC_SWTRIG_FLUSH_Msk (_U_(0x1) << ADC_SWTRIG_FLUSH_Pos)
#define ADC_SWTRIG_START_Msk (_U_(0x1) << ADC_SWTRIG_START_Pos)
#define ADC_INTENCLR_RESRDY_Msk (_U_(0x1) << ADC_INTENCLR_RESRDY_Pos)
#define ADC_INTENCLR_OVERRUN_Msk (_U_(0x1) << ADC_INTENCLR_OVERRUN_Pos)
#define ADC_INTENCLR_WINMON_Msk (_U_(0x1) << ADC_INTENCLR_WINMON_Pos)
#define ADC_INTENSET_RESRDY_Msk (_U_(0x1) << ADC_INTENSET_RESRDY_Pos)
#define ADC_INTENSET_OVERRUN_Msk (_U_(0x1) << ADC_INTENSET_OVERRUN_Pos)
#define ADC_INTENSET_WINMON_Msk (_U_(0x1) << ADC_INTENSET_WINMON_Pos)
#define ADC_INTFLAG_RESRDY_Msk (_U_(0x1) << ADC_INTFLAG_RESRDY_Pos)
#define ADC_INTFLAG_OVERRUN_Msk (_U_(0x1) << ADC_INTFLAG_OVERRUN_Pos)
#define ADC_INTFLAG_WINMON_Msk (_U_(0x1) << ADC_INTFLAG_WINMON_Pos)
#define ADC_STATUS_ADCBUSY_Msk (_U_(0x1) << ADC_STATUS_ADCBUSY_Pos)
#define ADC_SYNCBUSY_SWRST_Msk (_U_(0x1) << ADC_SYNCBUSY_SWRST_Pos)
#define ADC_SYNCBUSY_ENABLE_Msk (_U_(0x1) << ADC_SYNCBUSY_ENABLE_Pos)
#define ADC_SYNCBUSY_INPUTCTRL_Msk (_U_(0x1) << ADC_SYNCBUSY_INPUTCTRL_Pos)
#define ADC_SYNCBUSY_CTRLB_Msk (_U_(0x1) << ADC_SYNCBUSY_CTRLB_Pos)
#define ADC_SYNCBUSY_REFCTRL_Msk (_U_(0x1) << ADC_SYNCBUSY_REFCTRL_Pos)
#define ADC_SYNCBUSY_AVGCTRL_Msk (_U_(0x1) << ADC_SYNCBUSY_AVGCTRL_Pos)
#define ADC_SYNCBUSY_SAMPCTRL_Msk (_U_(0x1) << ADC_SYNCBUSY_SAMPCTRL_Pos)
#define ADC_SYNCBUSY_WINLT_Msk (_U_(0x1) << ADC_SYNCBUSY_WINLT_Pos)
#define ADC_SYNCBUSY_WINUT_Msk (_U_(0x1) << ADC_SYNCBUSY_WINUT_Pos)
#define ADC_SYNCBUSY_GAINCORR_Msk (_U_(0x1) << ADC_SYNCBUSY_GAINCORR_Pos)
#define ADC_SYNCBUSY_OFFSETCORR_Msk (_U_(0x1) << ADC_SYNCBUSY_OFFSETCORR_Pos)
#define ADC_SYNCBUSY_SWTRIG_Msk (_U_(0x1) << ADC_SYNCBUSY_SWTRIG_Pos)
#define ADC_DSEQCTRL_INPUTCTRL_Msk (_U_(0x1) << ADC_DSEQCTRL_INPUTCTRL_Pos)
#define ADC_DSEQCTRL_CTRLB_Msk (_U_(0x1) << ADC_DSEQCTRL_CTRLB_Pos)
#define ADC_DSEQCTRL_REFCTRL_Msk (_U_(0x1) << ADC_DSEQCTRL_REFCTRL_Pos)
#define ADC_DSEQCTRL_AVGCTRL_Msk (_U_(0x1) << ADC_DSEQCTRL_AVGCTRL_Pos)
#define ADC_DSEQCTRL_SAMPCTRL_Msk (_U_(0x1) << ADC_DSEQCTRL_SAMPCTRL_Pos)
#define ADC_DSEQCTRL_WINLT_Msk (_U_(0x1) << ADC_DSEQCTRL_WINLT_Pos)
#define ADC_DSEQCTRL_WINUT_Msk (_U_(0x1) << ADC_DSEQCTRL_WINUT_Pos)
#define ADC_DSEQCTRL_GAINCORR_Msk (_U_(0x1) << ADC_DSEQCTRL_GAINCORR_Pos)
#define ADC_DSEQCTRL_OFFSETCORR_Msk (_U_(0x1) << ADC_DSEQCTRL_OFFSETCORR_Pos)
#define ADC_DSEQCTRL_AUTOSTART_Msk (_U_(0x1) << ADC_DSEQCTRL_AUTOSTART_Pos)
#define ADC_DSEQSTAT_INPUTCTRL_Msk (_U_(0x1) << ADC_DSEQSTAT_INPUTCTRL_Pos)
#define ADC_DSEQSTAT_CTRLB_Msk (_U_(0x1) << ADC_DSEQSTAT_CTRLB_Pos)
#define ADC_DSEQSTAT_REFCTRL_Msk (_U_(0x1) << ADC_DSEQSTAT_REFCTRL_Pos)
#define ADC_DSEQSTAT_AVGCTRL_Msk (_U_(0x1) << ADC_DSEQSTAT_AVGCTRL_Pos)
#define ADC_DSEQSTAT_SAMPCTRL_Msk (_U_(0x1) << ADC_DSEQSTAT_SAMPCTRL_Pos)
#define ADC_DSEQSTAT_WINLT_Msk (_U_(0x1) << ADC_DSEQSTAT_WINLT_Pos)
#define ADC_DSEQSTAT_WINUT_Msk (_U_(0x1) << ADC_DSEQSTAT_WINUT_Pos)
#define ADC_DSEQSTAT_GAINCORR_Msk (_U_(0x1) << ADC_DSEQSTAT_GAINCORR_Pos)
#define ADC_DSEQSTAT_OFFSETCORR_Msk (_U_(0x1) << ADC_DSEQSTAT_OFFSETCORR_Pos)
#define ADC_DSEQSTAT_BUSY_Msk (_U_(0x1) << ADC_DSEQSTAT_BUSY_Pos)
#define ADC_CTRLA_Msk ADC_CTRLA_MASK
#define ADC_EVCTRL_Msk ADC_EVCTRL_MASK
#define ADC_DBGCTRL_Msk ADC_DBGCTRL_MASK
#define ADC_INPUTCTRL_Msk ADC_INPUTCTRL_MASK
#define ADC_CTRLB_Msk ADC_CTRLB_MASK
#define ADC_REFCTRL_Msk ADC_REFCTRL_MASK
#define ADC_AVGCTRL_Msk ADC_AVGCTRL_MASK
#define ADC_SAMPCTRL_Msk ADC_SAMPCTRL_MASK
#define ADC_WINLT_Msk ADC_WINLT_MASK
#define ADC_WINUT_Msk ADC_WINUT_MASK
#define ADC_GAINCORR_Msk ADC_GAINCORR_MASK
#define ADC_OFFSETCORR_Msk ADC_OFFSETCORR_MASK
#define ADC_SWTRIG_Msk ADC_SWTRIG_MASK
#define ADC_INTENCLR_Msk ADC_INTENCLR_MASK
#define ADC_INTENSET_Msk ADC_INTENSET_MASK
#define ADC_INTFLAG_Msk ADC_INTFLAG_MASK
#define ADC_STATUS_Msk ADC_STATUS_MASK
#define ADC_SYNCBUSY_Msk ADC_SYNCBUSY_MASK
#define ADC_DSEQDATA_Msk ADC_DSEQDATA_MASK
#define ADC_DSEQCTRL_Msk ADC_DSEQCTRL_MASK
#define ADC_DSEQSTAT_Msk ADC_DSEQSTAT_MASK
#define ADC_RESULT_Msk ADC_RESULT_MASK
#define ADC_RESS_Msk ADC_RESS_MASK
#define ADC_CALIB_Msk ADC_CALIB_MASK
#define AES_CTRLA_SWRST_Msk (_U_(0x1) << AES_CTRLA_SWRST_Pos)
#define AES_CTRLA_ENABLE_Msk (_U_(0x1) << AES_CTRLA_ENABLE_Pos)
#define AES_CTRLA_CIPHER_Msk (_U_(0x1) << AES_CTRLA_CIPHER_Pos)
#define AES_CTRLA_STARTMODE_Msk (_U_(0x1) << AES_CTRLA_STARTMODE_Pos)
#define AES_CTRLA_LOD_Msk (_U_(0x1) << AES_CTRLA_LOD_Pos)
#define AES_CTRLA_KEYGEN_Msk (_U_(0x1) << AES_CTRLA_KEYGEN_Pos)
#define AES_CTRLA_XORKEY_Msk (_U_(0x1) << AES_CTRLA_XORKEY_Pos)
#define AES_CTRLB_START_Msk (_U_(0x1) << AES_CTRLB_START_Pos)
#define AES_CTRLB_NEWMSG_Msk (_U_(0x1) << AES_CTRLB_NEWMSG_Pos)
#define AES_CTRLB_EOM_Msk (_U_(0x1) << AES_CTRLB_EOM_Pos)
#define AES_CTRLB_GFMUL_Msk (_U_(0x1) << AES_CTRLB_GFMUL_Pos)
#define AES_INTENCLR_ENCCMP_Msk (_U_(0x1) << AES_INTENCLR_ENCCMP_Pos)
#define AES_INTENCLR_GFMCMP_Msk (_U_(0x1) << AES_INTENCLR_GFMCMP_Pos)
#define AES_INTENSET_ENCCMP_Msk (_U_(0x1) << AES_INTENSET_ENCCMP_Pos)
#define AES_INTENSET_GFMCMP_Msk (_U_(0x1) << AES_INTENSET_GFMCMP_Pos)
#define AES_INTFLAG_ENCCMP_Msk (_U_(0x1) << AES_INTFLAG_ENCCMP_Pos)
#define AES_INTFLAG_GFMCMP_Msk (_U_(0x1) << AES_INTFLAG_GFMCMP_Pos)
#define AES_DBGCTRL_DBGRUN_Msk (_U_(0x1) << AES_DBGCTRL_DBGRUN_Pos)
#define AES_CTRLA_Msk AES_CTRLA_MASK
#define AES_CTRLB_Msk AES_CTRLB_MASK
#define AES_INTENCLR_Msk AES_INTENCLR_MASK
#define AES_INTENSET_Msk AES_INTENSET_MASK
#define AES_INTFLAG_Msk AES_INTFLAG_MASK
#define AES_DATABUFPTR_Msk AES_DATABUFPTR_MASK
#define AES_DBGCTRL_Msk AES_DBGCTRL_MASK
#define AES_KEYWORD_Msk AES_KEYWORD_MASK
#define AES_INDATA_Msk AES_INDATA_MASK
#define AES_INTVECTV_Msk AES_INTVECTV_MASK
#define AES_HASHKEY_Msk AES_HASHKEY_MASK
#define AES_GHASH_Msk AES_GHASH_MASK
#define AES_CIPLEN_Msk AES_CIPLEN_MASK
#define AES_RANDSEED_Msk AES_RANDSEED_MASK
#define DMAC_CTRL_SWRST_Msk (_U_(0x1) << DMAC_CTRL_SWRST_Pos)
#define DMAC_CTRL_DMAENABLE_Msk (_U_(0x1) << DMAC_CTRL_DMAENABLE_Pos)
#define DMAC_CTRL_LVLEN0_Msk (_U_(0x1) << DMAC_CTRL_LVLEN0_Pos)
#define DMAC_CTRL_LVLEN1_Msk (_U_(0x1) << DMAC_CTRL_LVLEN1_Pos)
#define DMAC_CTRL_LVLEN2_Msk (_U_(0x1) << DMAC_CTRL_LVLEN2_Pos)
#define DMAC_CTRL_LVLEN3_Msk (_U_(0x1) << DMAC_CTRL_LVLEN3_Pos)
#define DMAC_CRCSTATUS_CRCBUSY_Msk (_U_(0x1) << DMAC_CRCSTATUS_CRCBUSY_Pos)
#define DMAC_CRCSTATUS_CRCZERO_Msk (_U_(0x1) << DMAC_CRCSTATUS_CRCZERO_Pos)
#define DMAC_CRCSTATUS_CRCERR_Msk (_U_(0x1) << DMAC_CRCSTATUS_CRCERR_Pos)
#define DMAC_DBGCTRL_DBGRUN_Msk (_U_(0x1) << DMAC_DBGCTRL_DBGRUN_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG0_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG0_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG1_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG1_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG2_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG2_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG3_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG3_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG4_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG4_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG5_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG5_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG6_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG6_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG7_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG7_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG8_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG8_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG9_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG9_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG10_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG10_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG11_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG11_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG12_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG12_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG13_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG13_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG14_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG14_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG15_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG15_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG16_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG16_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG17_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG17_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG18_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG18_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG19_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG19_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG20_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG20_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG21_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG21_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG22_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG22_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG23_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG23_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG24_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG24_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG25_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG25_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG26_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG26_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG27_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG27_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG28_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG28_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG29_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG29_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG30_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG30_Pos)
#define DMAC_SWTRIGCTRL_SWTRIG31_Msk (_U_(0x1) << DMAC_SWTRIGCTRL_SWTRIG31_Pos)
#define DMAC_PRICTRL0_RRLVLEN0_Msk (_U_(0x1) << DMAC_PRICTRL0_RRLVLEN0_Pos)
#define DMAC_PRICTRL0_RRLVLEN1_Msk (_U_(0x1) << DMAC_PRICTRL0_RRLVLEN1_Pos)
#define DMAC_PRICTRL0_RRLVLEN2_Msk (_U_(0x1) << DMAC_PRICTRL0_RRLVLEN2_Pos)
#define DMAC_PRICTRL0_RRLVLEN3_Msk (_U_(0x1) << DMAC_PRICTRL0_RRLVLEN3_Pos)
#define DMAC_INTPEND_TERR_Msk (_U_(0x1) << DMAC_INTPEND_TERR_Pos)
#define DMAC_INTPEND_TCMPL_Msk (_U_(0x1) << DMAC_INTPEND_TCMPL_Pos)
#define DMAC_INTPEND_SUSP_Msk (_U_(0x1) << DMAC_INTPEND_SUSP_Pos)
#define DMAC_INTPEND_CRCERR_Msk (_U_(0x1) << DMAC_INTPEND_CRCERR_Pos)
#define DMAC_INTPEND_FERR_Msk (_U_(0x1) << DMAC_INTPEND_FERR_Pos)
#define DMAC_INTPEND_BUSY_Msk (_U_(0x1) << DMAC_INTPEND_BUSY_Pos)
#define DMAC_INTPEND_PEND_Msk (_U_(0x1) << DMAC_INTPEND_PEND_Pos)
#define DMAC_INTSTATUS_CHINT0_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT0_Pos)
#define DMAC_INTSTATUS_CHINT1_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT1_Pos)
#define DMAC_INTSTATUS_CHINT2_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT2_Pos)
#define DMAC_INTSTATUS_CHINT3_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT3_Pos)
#define DMAC_INTSTATUS_CHINT4_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT4_Pos)
#define DMAC_INTSTATUS_CHINT5_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT5_Pos)
#define DMAC_INTSTATUS_CHINT6_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT6_Pos)
#define DMAC_INTSTATUS_CHINT7_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT7_Pos)
#define DMAC_INTSTATUS_CHINT8_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT8_Pos)
#define DMAC_INTSTATUS_CHINT9_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT9_Pos)
#define DMAC_INTSTATUS_CHINT10_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT10_Pos)
#define DMAC_INTSTATUS_CHINT11_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT11_Pos)
#define DMAC_INTSTATUS_CHINT12_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT12_Pos)
#define DMAC_INTSTATUS_CHINT13_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT13_Pos)
#define DMAC_INTSTATUS_CHINT14_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT14_Pos)
#define DMAC_INTSTATUS_CHINT15_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT15_Pos)
#define DMAC_INTSTATUS_CHINT16_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT16_Pos)
#define DMAC_INTSTATUS_CHINT17_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT17_Pos)
#define DMAC_INTSTATUS_CHINT18_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT18_Pos)
#define DMAC_INTSTATUS_CHINT19_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT19_Pos)
#define DMAC_INTSTATUS_CHINT20_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT20_Pos)
#define DMAC_INTSTATUS_CHINT21_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT21_Pos)
#define DMAC_INTSTATUS_CHINT22_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT22_Pos)
#define DMAC_INTSTATUS_CHINT23_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT23_Pos)
#define DMAC_INTSTATUS_CHINT24_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT24_Pos)
#define DMAC_INTSTATUS_CHINT25_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT25_Pos)
#define DMAC_INTSTATUS_CHINT26_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT26_Pos)
#define DMAC_INTSTATUS_CHINT27_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT27_Pos)
#define DMAC_INTSTATUS_CHINT28_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT28_Pos)
#define DMAC_INTSTATUS_CHINT29_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT29_Pos)
#define DMAC_INTSTATUS_CHINT30_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT30_Pos)
#define DMAC_INTSTATUS_CHINT31_Msk (_U_(0x1) << DMAC_INTSTATUS_CHINT31_Pos)
#define DMAC_BUSYCH_BUSYCH0_Msk (_U_(0x1) << DMAC_BUSYCH_BUSYCH0_Pos)
#define DMAC_BUSYCH_BUSYCH1_Msk (_U_(0x1) << DMAC_BUSYCH_BUSYCH1_Pos)
